{
  "Resources": {
    "Certificate": {
      "Name": "AWS::CertificateManager::Certificate",
      "Properties": {
        "DomainName": {
          "Description": "Fully qualified domain name (FQDN), such as www.example.com, of                                 the site that you want to secure with the ACM certificate. To protect several                                 sites in the same domain, use an asterisk (*) to specify a wildcard.                                 For example, *.example.com protects www.example.com,                                 site.example.com, and images.example.com.For constraints, see the DomainName parameter for the RequestCertificate action in the AWS Certificate Manager API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "DomainValidationOptions": {
          "Description": "Domain information that domain name registrars use to verify your identity. For more information and the default values, see                                 Configure Email for Your Domain and Validate Domain Ownership in the AWS Certificate Manager User Guide.",
          "Array": true,
          "Type": "aws-properties-certificatemanager-certificate-domainvalidationoption",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "SubjectAlternativeNames": {
          "Description": "FQDNs to be included in the Subject Alternative Name extension of the ACM certificate. For example, you can add www.example.net to a certificate for the www.example.com domain name so that users can reach your site by using either name.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "Tags": {
          "Description": "An arbitrary set of tags (key–value pairs) for this ACM certificate.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption."
        }
      }
    }
  },
  "Models": {
    "aws-properties-certificatemanager-certificate-domainvalidationoption": {
      "Name": "AWSCertificateManagerCertificateDomainValidationOption",
      "Properties": {
        "DomainName": {
          "Description": "Fully Qualified Domain Name (FQDN) of the Certificate that you are requesting.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "ValidationDomain": {
          "Description": "The domain that domain name registrars use to send validation emails. Registrars use this value as the email address suffix                                 when sending emails to verify your identity. This value must be the same as the domain name or a superdomain of the domain                                 name. For more information, see the ValidationDomain content for the DomainValidationOption data type in the AWS Certificate Manager API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-resource-tags": {
      "Name": "AWSCloudFormationResourceTagsType",
      "Properties": {
        "Key": {
          "Description": "The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with                                 aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Value": {
          "Description": "The value for the tag. You can specify a value that is 1 to 255 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    }
  }
}
