{
  "Resources": {
    "ConfigRule": {
      "Name": "AWS::Config::ConfigRule",
      "Properties": {
        "ConfigRuleName": {
          "Description": "A name for the AWS Config rule. If you don't specify a name, AWS CloudFormation generates a unique                                 physical ID and uses that ID for the rule name. For more information, see Name Type.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "Description": {
          "Description": "A description about this AWS Config rule.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "InputParameters": {
          "Description": "Input parameter values that are passed to the AWS Config rule (Lambda function).",
          "Array": false,
          "Type": "Object",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "MaximumExecutionFrequency": {
          "Description": "The maximum frequency at which the AWS Config rule runs evaluations. For valid values, see                                 the ConfigRule data type in the                                 AWS Config API Reference.If the rule runs an evaluation when AWS Config delivers a configuration snapshot, the rule                                 cannot run more frequently than the snapshot delivery frequency. Set an execution                                 frequency value that is equal to or greater than the value of the snapshot delivery                                 frequency, which is a property the AWS::Config::DeliveryChannel resource.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Scope": {
          "Description": "Defines which AWS resources will trigger an evaluation when their configurations                                 change. The scope can include one or more resource types, a combination of a tag key and                                 value, or a combination of one resource type and one resource ID. Specify a scope to                                 constrain the resources that are evaluated. If you don't specify a scope, the rule                                 evaluates all resources in the recording group.",
          "Array": false,
          "Type": "aws-properties-config-configrule-scope",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Source": {
          "Description": "Specifies the rule owner, the rule identifier, and the events that cause the                                 function to evaluate your AWS resources.",
          "Array": false,
          "Type": "aws-properties-config-configrule-source",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "ConfigurationRecorder": {
      "Name": "AWS::Config::ConfigurationRecorder",
      "Properties": {
        "Name": {
          "Description": "A name for the configuration recorder. If you don't specify a name, AWS CloudFormation generates                                 a unique physical ID and uses that ID for the configuration recorder name. For more                                 information, see Name Type.NoteAfter you create a configuration recorder, you cannot rename it. If you don't want                                    a AWS CloudFormation-generated name, specify a value for this property.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Updates are not supported."
        },
        "RecordingGroup": {
          "Description": "Indicates whether to record configurations for all supported resources or for a list                                 of resource types. The resource types that you list must be supported by AWS Config.",
          "Array": false,
          "Type": "aws-properties-config-configurationrecorder-recordinggroup",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "RoleARN": {
          "Description": "The Amazon Resource Name (ARN) of the AWS Identity and Access Management (IAM) role that is used to make                                 read or write requests to the delivery channel that you specify and to get configuration                                 details for supported AWS resources. For more information, see Permissions for the AWS Config IAM                                    Role in the AWS Config Developer Guide.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "DeliveryChannel": {
      "Name": "AWS::Config::DeliveryChannel",
      "Properties": {
        "ConfigSnapshotDeliveryProperties": {
          "Description": "Provides options for how AWS Config delivers configuration snapshots to the S3 bucket in                                 your delivery channel.",
          "Array": false,
          "Type": "aws-properties-config-deliverychannel-configsnapshotdeliveryproperties",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Name": {
          "Description": "A name for the delivery channel. If you don't specify a name, AWS CloudFormation generates a                                 unique physical ID and uses that ID for the delivery channel name. For more information,                                 see Name Type.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Updates are not supported.. To change the name, you must run two separate updates.\n                                 Delete this resource in the first update and then recreate it with a new name in the\n                                 second update."
        },
        "S3BucketName": {
          "Description": "The name of an S3 bucket where you want to store configuration history for the                                 delivery channel.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "S3KeyPrefix": {
          "Description": "A key prefix (folder) for the specified S3 bucket.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "SnsTopicARN": {
          "Description": "The Amazon Resource Name (ARN) of the Amazon Simple Notification Service (Amazon SNS) topic that AWS Config delivers                                 notifications to.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    }
  },
  "Models": {
    "aws-properties-config-configrule-scope": {
      "Name": "AWSConfigConfigRuleScope",
      "Properties": {
        "ComplianceResourceId": {
          "Description": "The ID of an AWS resource that you want AWS Config to evaluate against a rule. If you                                 specify an ID, you must also specify a resource type for the                                 ComplianceResourceTypes property.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "ComplianceResourceTypes": {
          "Description": "The types of AWS resources that you want AWS Config to evaluate against the rule. If you                                 specify the ComplianceResourceId property, specify only one resource                                 type.",
          "Array": true,
          "Type": "String",
          "Required": "Conditional. If you specify a value for the                                 ComplianceResourceId property, you must also specify this                                 property."
        },
        "TagKey": {
          "Description": "The tag key that is applied to the AWS resources that you want AWS Config to evaluate                                 against the rule.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. If you specify a tag value, you must specify this                                 property."
        },
        "TagValue": {
          "Description": "The tag value that is applied to the AWS resources that you want AWS Config to evaluate                                 against the rule.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. If you specify a tag key, you must specify this                                 property."
        }
      }
    },
    "aws-properties-config-configrule-source": {
      "Name": "AWSConfigConfigRuleSource",
      "Properties": {
        "Owner": {
          "Description": "Indicates who owns and manages the AWS Config rule. For valid values, see the Source data type in the                                 AWS Config API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "SourceDetails": {
          "Description": "Provides the source and type of event that triggers AWS Config to evaluate your AWS                                 resources.",
          "Array": true,
          "Type": "aws-properties-config-configrule-source-sourcedetails",
          "Required": "No"
        },
        "SourceIdentifier": {
          "Description": "For AWS managed rules, the identifier of the rule. For a list of identifiers, see                                 AWS Managed                                    Rules in the AWS Config Developer Guide.For customer managed rules, the Amazon Resource Name (ARN) of the rule's                                 Lambda function.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-config-configrule-source-sourcedetails": {
      "Name": "AWSConfigConfigRuleSourceSourceDetails",
      "Properties": {
        "EventSource": {
          "Description": "The source, such as an AWS service, that generate events, triggering AWS Config to                                 evaluate your AWS resources. For valid values, see the SourceDetail data type in the                                 AWS Config API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "MaximumExecutionFrequency": {
          "Description": "The frequency that you want AWS Config to run evaluations for a custom rule with a periodic trigger. By default, rules with                                 a periodic trigger are evaluated every 24 hours. If you specify a value for MaximumExecutionFrequency, then MessageType must use the ScheduledNotification value.Valid values: One_Hour,  Three_Hours,  Six_Hours,  Twelve_Hours, or TwentyFour_Hours.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "MessageType": {
          "Description": "The type of Amazon Simple Notification Service (Amazon SNS) message that triggers AWS Config to run an                                 evaluation.To run an evaluation when AWS Config delivers a configuration item change notification,                                 specify ConfigurationItemChangeNotification.To run an evaluation when AWS Config delivers a configuration snapshot, specify                                 ConfigurationSnapshotDeliveryCompleted.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-config-configurationrecorder-recordinggroup": {
      "Name": "AWSConfigConfigurationRecorderRecordingGroup",
      "Properties": {
        "AllSupported": {
          "Description": "Indicates whether to record all supported resource types. If you specify this                                 property, do not specify the ResourceTypes property.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No"
        },
        "IncludeGlobalResourceTypes": {
          "Description": "Indicates whether AWS Config records all supported global resource types. When AWS Config                                 supports new global resource types, AWS Config will automatically start recording them if you                                 enable this property.NoteIf you set this property to true, you must set the                                    AllSupported property to                                    true.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No"
        },
        "ResourceTypes": {
          "Description": "A list of valid AWS resource types to include in this recording group, such as                                 AWS::EC2::Instance or                                 AWS::CloudTrail::Trail. If you specify this property, do not                                 specify the AllSupported property. For a list of supported resource types,                                 see Supported resource types in the AWS Config Developer Guide.",
          "Array": true,
          "Type": "String",
          "Required": "No"
        }
      }
    },
    "aws-properties-config-deliverychannel-configsnapshotdeliveryproperties": {
      "Name": "AWSConfigDeliveryChannelConfigSnapshotDeliveryProperties",
      "Properties": {
        "DeliveryFrequency": {
          "Description": "The frequency with which AWS Config delivers configuration snapshots. For valid                                 values, see ConfigSnapshotDeliveryProperties in the                                 AWS Config API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        }
      }
    }
  }
}
