{"Resources":{"Destination":{"Name":"AWS::Logs::Destination","Properties":{"DestinationName":{"Description":"The name of the CloudWatch Logs destination.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"DestinationPolicy":{"Description":"An AWS Identity and Access Management (IAM) policy that specifies who can write to                                 your                                 destination.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"No interruption"},"RoleArn":{"Description":"The Amazon Resource Name (ARN) of an IAM role that permits CloudWatch Logs to send                                 data                                 to the specified AWS resource (TargetArn).","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"No interruption"},"TargetArn":{"Description":"The ARN of the AWS resource that receives log events. Currently, you can                                 specify only an Amazon Kinesis stream.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"No interruption"}}},"LogGroup":{"Name":"AWS::Logs::LogGroup","Properties":{"LogGroupName":{"Description":"A name for the log group. If you don't specify a name, AWS CloudFormation generates                                 a unique                                 physical ID and uses that ID for the log group. For more information, see Name Type.ImportantIf you specify a name, you cannot perform updates that require replacement of this                                    resource.                                    You can perform updates that require no or some interruption. If you must replace                                    the resource, specify a new name.","Array":false,"Type":"String","Required":"No","UpdateRequires":"Replacement"},"RetentionInDays":{"Description":"The number of days log events are kept in CloudWatch Logs. When a log event expires,                                 CloudWatch Logs automatically deletes it. For valid values, see PutRetentionPolicy in                                 the Amazon CloudWatch Logs API Reference.","Array":false,"Type":"Number","Required":"No","UpdateRequires":"No interruption"}}},"LogStream":{"Name":"AWS::Logs::LogStream","Properties":{"LogGroupName":{"Description":"The name of the log group where the log stream is created.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"LogStreamName":{"Description":"The name of the log stream to create. The name must be unique within the log                                 group.","Array":false,"Type":"String","Required":"No","UpdateRequires":"Replacement"}}},"SubscriptionFilter":{"Name":"AWS::Logs::SubscriptionFilter","Properties":{"DestinationArn":{"Description":"The Amazon Resource Name (ARN) of the Amazon Kinesis stream or Lambda function that                                 you                                 want to use as the subscription feed destination.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"FilterPattern":{"Description":"The filtering expressions that restrict what gets delivered to the destination                                 AWS resource. For more information about the filter pattern syntax, see Filter and Pattern                                    Syntax in the Amazon CloudWatch User Guide.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"LogGroupName":{"Description":"The log group to associate with the subscription filter. All log events that                                 are uploaded to this log group are filtered and delivered to the specified AWS                                 resource if the filter pattern matches the log events.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"RoleArn":{"Description":"An IAM role that grants CloudWatch Logs permission to put data into the specified                                 Amazon Kinesis stream. For Lambda and CloudWatch Logs destinations, don't specify                                 this property because CloudWatch Logs gets the necessary permissions from the destination                                 resource.","Array":false,"Type":"String","Required":"No","UpdateRequires":"Replacement"}}},"MetricFilter":{"Name":"AWS::Logs::MetricFilter","Properties":{"FilterPattern":{"Description":"Describes the pattern that CloudWatch Logs follows to interpret each entry in a log.                                 For                                 example, a log entry might contain fields such as timestamps, IP addresses, error                                 codes, bytes transferred, and so on. You use the pattern to specify those fields                                 and to specify what to look for in the log file. For example, if you're interested                                 in error codes that begin with 1234, your filter pattern might be                                 [timestamps, ip_addresses, error_codes = 1234*, size, ...].","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"No interruption"},"LogGroupName":{"Description":"The name of an existing log group that you want to associate with this metric                                 filter.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"MetricTransformations":{"Description":"Describes how to transform data from a log into a CloudWatch metric.ImportantCurrently, you can specify only one metric transformation for each metric                                    filter. If you want to specify multiple metric transformations, you must                                    specify multiple metric filters.","Array":true,"Type":"aws-properties-logs-metricfilter-metrictransformation","Required":"Yes","UpdateRequires":"No interruption"}}}},"Models":{"aws-properties-logs-metricfilter-metrictransformation":{"Name":"CloudWatchLogsMetricFilterMetricTransformationProperty","Properties":{"MetricName":{"Description":"The name of the CloudWatch metric to which the log information will be                                 published.","Array":false,"Type":"String","Required":"Yes"},"MetricNamespace":{"Description":"The destination namespace of the CloudWatch metric. Namespaces are containers for                                 metrics. For example, you can add related metrics in the same namespace.","Array":false,"Type":"String","Required":"Yes"},"MetricValue":{"Description":"The value that is published to the CloudWatch metric. For example, if you're counting                                 the occurrences of a particular term like Error, specify                                 1 for the metric value. If you're counting the number of bytes                                 transferred, reference the value that is in the log event by using $                                 followed by the name of the field that you specified in the filter pattern, such                                 as $size.","Array":false,"Type":"String","Required":"Yes"}}}}}
