{
  "Application": {
    "Name": "AWS::CodeDeploy::Application",
    "Properties": {
      "ApplicationName": {
        "Description": "A name for the application. If you don't specify a name, AWS CloudFormation generates a unique            physical ID and uses that ID for the application name. For more information, see Name Type.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Updates are not supported."
      }
    }
  },
  "DeploymentConfig": {
    "Name": "AWS::CodeDeploy::DeploymentConfig",
    "Properties": {
      "DeploymentConfigName": {
        "Description": "A name for the deployment configuration. If you don't specify a name, AWS CloudFormation                  generates a unique physical ID and uses that ID for the deployment configuration                  name. For more information, see Name Type.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Replacement"
      },
      "MinimumHealthyHosts": {
        "Description": "The minimum number of healthy instances that must be available at any time                  during an AWS CodeDeploy deployment. For example, for a fleet of nine instances, if you                  specify a minimum of six healthy instances, AWS CodeDeploy deploys your application up to                  three instances at a time so that you always have six healthy instances. The                  deployment succeeds if your application successfully deploys to six or more                  instances; otherwise, the deployment fails.For more information about instance health, see AWS CodeDeploy Instance Health in the                     AWS CodeDeploy User Guide.",
        "Array": false,
        "Type": "AWSCodeDeployDeploymentConfigMinimumHealthyHosts",
        "Required": "No",
        "UpdateRequires": "Replacement"
      }
    }
  },
  "DeploymentGroup": {
    "Name": "AWS::CodeDeploy::DeploymentGroup",
    "Properties": {
      "ApplicationName": {
        "Description": "The name of an AWS CodeDeploy application for this deployment group.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "AutoScalingGroups": {
        "Description": "A list of associated Auto Scaling groups that AWS CodeDeploy automatically deploys revisions to                  when new instances are created.",
        "Array": true,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "Deployment": {
        "Description": "The application revision that will be deployed to this deployment group.",
        "Array": false,
        "Type": "AWSCodeDeployDeploymentGroupDeployment",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "DeploymentConfigName": {
        "Description": "A deployment configuration name or a predefined configuration name. With                  predefined configurations, you can deploy application revisions to one instance at                  a time, half of the instances at a time, or all the instances at once. For more                  information and valid values, see the DeploymentConfigName parameter                  for the CreateDeploymentGroup action in the                     AWS CodeDeploy API Reference.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "DeploymentGroupName": {
        "Description": "A name for the deployment group. If you don't specify a name, AWS CloudFormation generates a                  unique physical ID and uses that ID for the deployment group name. For more                  information, see Name Type.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Replacement"
      },
      "Ec2TagFilters": {
        "Description": "The Amazon EC2 tags to filter on. AWS CodeDeploy includes all instances that match the tag                  filter with this deployment group.",
        "Array": false,
        "Type": "AWSCodeDeployDeploymentGroupEc2TagFilters",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "OnPremisesInstanceTagFilters": {
        "Description": "The on-premises instance tags to filter on. AWS CodeDeploy includes all on-premises                  instances that match the tag filter with this deployment group. To register                  on-premises instances with AWS CodeDeploy, see Configure Existing                     On-Premises Instances by Using AWS CodeDeploy in the                     AWS CodeDeploy User Guide.",
        "Array": false,
        "Type": "AWSCodeDeployDeploymentGroupOnPremisesInstanceTagFilters",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "ServiceRoleArn": {
        "Description": "A service role Amazon Resource Name (ARN) that grants AWS CodeDeploy permission to make                  calls to AWS services on your behalf. For more information, see Create a Service Role for                     AWS CodeDeploy in the AWS CodeDeploy User Guide.NoteIn some cases, you might need to add a dependency on the service role's                     policy. For more information, see IAM role policy in DependsOn Attribute.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      }
    }
  }
}
