{
  "Table": {
    "Name": "AWS::DynamoDB::Table",
    "Properties": {
      "AttributeDefinitions": {
        "Description": "A list of AttributeName and AttributeType objects            that describe the key schema for the table and indexes.",
        "Array": true,
        "Type": "DynamoDBAttributeDefinitions",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "GlobalSecondaryIndexes": {
        "Description": "Global secondary indexes to be created on the table. You can create up to 5 global            secondary indexes.ImportantIf you update a table to include a new global secondary index, AWS CloudFormation initiates                the index creation and then proceeds with the stack update. AWS CloudFormation doesn't wait for                the index to complete creation because the backfilling phase can take a long time,                depending on the size of the table. You cannot use the index or update the table                until the index's status is ACTIVE. You can track its status by using                the DynamoDB DescribeTable command.If you add or delete an index during an update, we recommend that you don't                update any other resources. If your stack fails to update and is rolled back while                adding a new index, you must manually delete the index.If you update only the provisioned throughput values of global secondary                  indexes, you can update the table without                    interruption.You can delete or add one global secondary index without interruption. If you do both in the                  same update (for example, by changing the index's logical ID), the update                  fails.",
        "Array": true,
        "Type": "DynamoDBGlobalSecondaryIndexes",
        "Required": "No",
        "UpdateRequires": "Updates are not supported. with the following exceptions:"
      },
      "KeySchema": {
        "Description": "Specifies the attributes that make up the primary key for the table. The            attributes in the KeySchema property must also be defined in the              AttributeDefinitions property.",
        "Array": true,
        "Type": "DynamoDBKeySchema",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "LocalSecondaryIndexes": {
        "Description": "Local secondary indexes to be created on the table. You can create up to 5 local            secondary indexes. Each index is scoped to a given hash key value. The size of each hash            key can be up to 10 gigabytes.",
        "Array": true,
        "Type": "DynamoDBLocalSecondaryIndexes",
        "Required": "No",
        "UpdateRequires": "Replacement"
      },
      "ProvisionedThroughput": {
        "Description": "Throughput for the specified table, consisting of values for ReadCapacityUnits and            WriteCapacityUnits. For more information about the contents of a provisioned throughput            structure, see DynamoDB Provisioned      Throughput.",
        "Array": false,
        "Type": "DynamoDBProvisionedThroughput",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      },
      "StreamSpecification": {
        "Description": "The settings for the DynamoDB table stream, which capture changes to items stored in            the table.",
        "Array": false,
        "Type": "DynamoDBTableStreamSpecification",
        "Required": "No",
        "UpdateRequires": "No interruption to the table; however, the stream is replaced."
      },
      "TableName": {
        "Description": "A name for the table. If you don't specify a name, AWS CloudFormation generates a unique            physical ID and uses that ID for the table name. For more information, see Name Type.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Replacement"
      }
    }
  }
}
