{
  "Alias": {
    "Name": "AWS::Lambda::Alias",
    "Properties": {
      "Description": {
        "Description": "Information about the alias, such as its purpose or the Lambda function that is associated with it.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "FunctionName": {
        "Description": "The Lambda function that you want to associate with this alias. You can specify the function's name or its Amazon Resource Name (ARN).",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "FunctionVersion": {
        "Description": "The version of the Lambda function that you want to associate with this alias.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      },
      "Name": {
        "Description": "A name for the alias.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      }
    }
  },
  "EventSourceMapping": {
    "Name": "AWS::Lambda::EventSourceMapping",
    "Properties": {
      "BatchSize": {
        "Description": "The largest number of records that Lambda retrieves from your event source when                  invoking your function. Your function receives an event with all the retrieved                  records. For the default and valid values, see CreateEventSourceMapping in the                  AWS Lambda Developer Guide.",
        "Array": false,
        "Type": "Number",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "Enabled": {
        "Description": "Indicates whether Lambda begins polling the event source.",
        "Array": false,
        "Type": "Boolean",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "EventSourceArn": {
        "Description": "The Amazon Resource Name (ARN) of the Amazon Kinesis or DynamoDB stream that is the source                  of events. Any record added to this stream can invoke the Lambda function. For more                  information, see CreateEventSourceMapping in the                  AWS Lambda Developer Guide.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "FunctionName": {
        "Description": "The name or ARN of a Lambda function to invoke when Lambda detects an event on                  the stream.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      },
      "StartingPosition": {
        "Description": "The position in the stream where Lambda starts reading. For valid values, see                     CreateEventSourceMapping in the                  AWS Lambda Developer Guide.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      }
    }
  },
  "Function": {
    "Name": "AWS::Lambda::Function",
    "Properties": {
      "Code": {
        "Description": "The source code of your Lambda function. You can point to a file in an Amazon Simple Storage Service            (Amazon S3) bucket or specify your source code as inline text.",
        "Array": false,
        "Type": "AWSLambdaFunctionCode",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      },
      "Description": {
        "Description": "A description of the function.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "Environment": {
        "Description": "Key-value pairs that Lambda caches and makes available for your Lambda functions.                  Use environment variables to apply configuration changes, such as test and                  production environment configurations, without changing your Lambda function source                  code.",
        "Array": false,
        "Type": "AWSLambdaFunctionEnvironment",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "FunctionName": {
        "Description": "A name for the function. If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the function's name. For more information, see Name Type.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Replacement"
      },
      "Handler": {
        "Description": "The name of the function (within your source code) that Lambda calls to start running                  your code. For more information, see the Handler property                  in the AWS Lambda Developer Guide.NoteIf you specify your source code as inline text by specifying the ZipFile property within the Code property, specify index.function_name as the handler.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      },
      "KmsKeyArn": {
        "Description": "The Amazon Resource Name (ARN) of an AWS Key Management Service (AWS KMS) key that Lambda uses to                  encrypt and decrypt environment variable values.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "MemorySize": {
        "Description": "The amount of memory, in MB, that is allocated to your Lambda function. Lambda                  uses this value to proportionally allocate the amount of CPU power. For more                  information, see Resource                     Model in the AWS Lambda Developer Guide.Your function use case determines your CPU and memory requirements. For                  example, a database operation might need less memory than an image processing                  function. You must specify a value that is greater than or equal to                     128, and it must be a multiple of 64. You cannot specify a size                  larger than 1536. The default value is 128 MB.",
        "Array": false,
        "Type": "Number",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "Role": {
        "Description": "The Amazon Resource Name (ARN) of the AWS Identity and Access Management (IAM) execution role that                  Lambda assumes when it runs your code to access AWS services.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "No interruption"
      },
      "Runtime": {
        "Description": "The runtime environment for the Lambda function that you are uploading. For valid values, see the Runtime property in the AWS Lambda Developer Guide.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "Timeout": {
        "Description": "The function execution time (in seconds) after which Lambda terminates the                  function. Because the execution time affects cost, set this value based on the                  function's expected execution time. By default,  Timeout is set to                     3 seconds.",
        "Array": false,
        "Type": "Number",
        "Required": "No",
        "UpdateRequires": "No interruption"
      },
      "VpcConfig": {
        "Description": "If the Lambda function requires access to resources in a VPC, specify a VPC configuration that Lambda uses to set up an elastic network interface (ENI). The ENI enables your function to connect to other resources in your VPC, but it doesn't provide public Internet access. If your function requires Internet access (for example, to access AWS services that don't have VPC endpoints), configure a Network Address Translation (NAT) instance inside your VPC or use an Amazon Virtual Private Cloud                  (Amazon VPC) NAT gateway. For more information, see NAT Gateways in the Amazon VPC User Guide.",
        "Array": false,
        "Type": "AWSLambdaFunctionVPCConfig",
        "Required": "No",
        "UpdateRequires": "No interruption"
      }
    }
  },
  "Permission": {
    "Name": "AWS::Lambda::Permission",
    "Properties": {
      "Action": {
        "Description": "The Lambda actions that you want to allow in this statement. For example, you can specify lambda:CreateFunction to specify a certain action, or use a wildcard (lambda:*) to grant permission to all Lambda actions. For a list of actions, see Actions and Condition Context Keys for AWS Lambda in the IAM User Guide.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "FunctionName": {
        "Description": "The name (physical ID), Amazon Resource Name (ARN), or alias ARN of the Lambda                  function that you want to associate with this statement. Lambda adds this statement                  to the function's access policy.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "Principal": {
        "Description": "The entity for which you are granting permission to invoke the Lambda function.                  This entity can be any valid AWS service principal, such as                     s3.amazonaws.com or sns.amazonaws.com, or, if you are                  granting cross-account permission, an AWS account ID. For example, you might want                  to allow a custom application in another AWS account to push events to Lambda by                  invoking your function.",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      },
      "SourceAccount": {
        "Description": "The AWS account ID (without hyphens) of the source owner. For example, if you                  specify an S3 bucket in the SourceArn property, this value is the                  bucket owner's account ID. You can use this property to ensure that all source                  principals are owned by a specific account.ImportantThis property is not supported by all event sources. For more information, see the SourceAccount parameter for the AddPermission action in the AWS Lambda Developer Guide.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Replacement"
      },
      "SourceArn": {
        "Description": "The ARN of a resource that is invoking your function. When granting Amazon Simple Storage Service                  (Amazon S3) permission to invoke your function, specify this property with the bucket                  ARN as its value. This ensures that events generated only from the specified                  bucket, not just any bucket from any AWS account that creates a mapping to your                  function, can invoke the function.ImportantThis property is not supported by all event sources. For more information, see the SourceArn parameter for the AddPermission action in the AWS Lambda Developer Guide.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Replacement"
      }
    }
  },
  "Version": {
    "Name": "AWS::Lambda::Version",
    "Properties": {
      "CodeSha256": {
        "Description": "The SHA-256 hash of the deployment package that you want to publish. This value must match the SHA-256 hash of the $LATEST version of the function. Specify this property to validate that you are publishing the correct package.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Updates are not supported."
      },
      "Description": {
        "Description": "A description of the version you are publishing. If you don't specify a value, Lambda copies the description from the $LATEST version of the function.",
        "Array": false,
        "Type": "String",
        "Required": "No",
        "UpdateRequires": "Updates are not supported."
      },
      "FunctionName": {
        "Description": "The Lambda function for which you want to publish a version. You can specify the function's name or its Amazon Resource Name (ARN).",
        "Array": false,
        "Type": "String",
        "Required": "Yes",
        "UpdateRequires": "Replacement"
      }
    }
  }
}
