{
  "Resources": {
    "ScalableTarget": {
      "Name": "AWS::ApplicationAutoScaling::ScalableTarget",
      "Properties": {
        "MaxCapacity": {
          "Description": "The maximum value that Application Auto Scaling can use to scale a target during a scaling activity.",
          "Array": false,
          "Type": "Number",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "MinCapacity": {
          "Description": "The minimum value that Application Auto Scaling can use to scale a target during a scaling activity.",
          "Array": false,
          "Type": "Number",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "ResourceId": {
          "Description": "The unique resource identifier to associate with this scalable target. For more information, see the ResourceId parameter for the RegisterScalableTarget action in the Application Auto Scaling API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "RoleARN": {
          "Description": "The Amazon Resource Name (ARN) of an AWS Identity and Access Management (IAM) role that allows Application Auto Scaling to                                 modify your scalable target.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "ScalableDimension": {
          "Description": "The scalable dimension associated with the scalable target. Specify the service namespace, resource type, and scaling property,                                 such as ecs:service:DesiredCount for the desired task count of an Amazon EC2 Container Service service. For valid values, see the ScalableDimension content for the ScalingPolicy data type in the Application Auto Scaling API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "ServiceNamespace": {
          "Description": "The AWS service namespace of the scalable target. For a list of service namespaces, see AWS Service Namespaces in the AWS General Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        }
      }
    },
    "ScalingPolicy": {
      "Name": "AWS::ApplicationAutoScaling::ScalingPolicy",
      "Properties": {
        "PolicyName": {
          "Description": "A name for the scaling policy.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "PolicyType": {
          "Description": "An Application Auto Scaling policy type. For valid values, see the PolicyType parameter for the PutScalingPolicy action in the Application Auto Scaling API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "ResourceId": {
          "Description": "The unique resource identifier for the scalable target that this scaling policy applies to. For more information, see the                                 ResourceId parameter for the PutScalingPolicy action in the Application Auto Scaling API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. You must specify either the ScalingTargetId property or the ResourceId, ScalableDimension, and ServiceNamespace properties. If you specify the ResourceId, ScalableDimension, and ServiceNamespace properties, don't specify the ScalingTargetId property.",
          "UpdateRequires": "Replacement"
        },
        "ScalableDimension": {
          "Description": "The scalable dimension of the scalable target that this scaling policy applies to. The scalable dimension contains the service                                 namespace, resource type, and scaling property, such as ecs:service:DesiredCount for the desired task count of an Amazon ECS                                 service.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. You must specify either the ScalingTargetId property or the ResourceId, ScalableDimension, and ServiceNamespace properties. If you specify the ResourceId, ScalableDimension, and ServiceNamespace properties, don't specify the ScalingTargetId property.",
          "UpdateRequires": "Replacement"
        },
        "ServiceNamespace": {
          "Description": "The AWS service namespace of the scalable target that this scaling policy applies to. For a list of service namespaces, see                                 AWS Service Namespaces in the AWS General Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. You must specify either the ScalingTargetId property or the ResourceId, ScalableDimension, and ServiceNamespace properties. If you specify the ResourceId, ScalableDimension, and ServiceNamespace properties, don't specify the ScalingTargetId property.",
          "UpdateRequires": "Replacement"
        },
        "ScalingTargetId": {
          "Description": "The AWS CloudFormation-generated ID of an Application Auto Scaling scalable target. For more information about                                 the ID, see the Return Value section of the AWS::ApplicationAutoScaling::ScalableTarget resource.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. You must specify either the ScalingTargetId property or the ResourceId, ScalableDimension, and ServiceNamespace properties. If you specify this property, don't specify the ResourceId, ScalableDimension, and ServiceNamespace properties.",
          "UpdateRequires": "Replacement"
        },
        "StepScalingPolicyConfiguration": {
          "Description": "A step policy that configures when Application Auto Scaling scales resources up or down, and by how much.",
          "Array": false,
          "Type": "aws-properties-applicationautoscaling-scalingpolicy-stepscalingpolicyconfiguration",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    }
  },
  "Models": {
    "aws-properties-applicationautoscaling-scalingpolicy-stepscalingpolicyconfiguration": {
      "Name": "ApplicationAutoScalingScalingPolicyStepScalingPolicyConfiguration",
      "Properties": {
        "AdjustmentType": {
          "Description": "Specifies whether the ScalingAdjustment value in the StepAdjustment property is an absolute number or a percentage of the current capacity. For valid values, see the AdjustmentType content for the StepScalingPolicyConfiguration data type in the Application Auto Scaling API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "Cooldown": {
          "Description": "The amount of time, in seconds, after a scaling activity completes before any                                 further trigger-related scaling activities can start. For more information, see the                                 Cooldown content for the StepScalingPolicyConfiguration data type in the                                 Application Auto Scaling API Reference.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "MetricAggregationType": {
          "Description": "The aggregation type for the CloudWatch metrics. You can specify Minimum, Maximum, or Average. By default, AWS CloudFormation specifies Average. For more information, see Aggregation in the Amazon CloudWatch User Guide.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "MinAdjustmentMagnitude": {
          "Description": "The minimum number of resources to adjust when a scaling activity is triggered. If you specify PercentChangeInCapacity for the adjustment type, the scaling policy scales the target by this amount.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "StepAdjustments": {
          "Description": "A set of adjustments that enable you to scale based on the size of the alarm breach.",
          "Array": true,
          "Type": "aws-properties-applicationautoscaling-scalingpolicy-stepscalingpolicyconfiguration-stepadjustment",
          "Required": "No"
        }
      }
    },
    "aws-properties-applicationautoscaling-scalingpolicy-stepscalingpolicyconfiguration-stepadjustment": {
      "Name": "ApplicationAutoScalingScalingPolicyStepScalingPolicyConfigurationStepAdjustment",
      "Properties": {
        "MetricIntervalLowerBound": {
          "Description": "The lower bound of the breach size. The lower bound is the difference between the breach threshold and the aggregated CloudWatch                                 metric value. If the metric value is within the lower and upper bounds, Application Auto Scaling triggers this step adjustment.If the metric value is above the breach threshold, the metric must be greater than or equal to the threshold plus the lower                                 bound to trigger this step adjustment (the metric value is inclusive). If the metric value is below the breach threshold,                                 the metric must be greater than the threshold plus the lower bound to trigger this step adjustment (the metric value is exclusive).                                 A null value indicates negative infinity.",
          "Array": false,
          "Type": "Number",
          "Required": "Conditional. You must specify at least one upper or lower bound."
        },
        "MetricIntervalUpperBound": {
          "Description": "The upper bound of the breach size. The upper bound is the difference between the breach threshold and the CloudWatch metric                                 value. If the metric value is within the lower and upper bounds, Application Auto Scaling triggers this step adjustment.If the metric value is above the breach threshold, the metric must be less than the threshold plus the upper bound to trigger                                 this step adjustment (the metric value is exclusive). If the metric value is below the breach threshold, the metric must be                                 less than or equal to the threshold plus the upper bound to trigger this step adjustment (the metric value is inclusive).                                 A null value indicates positive infinity.",
          "Array": false,
          "Type": "Number",
          "Required": "Conditional. You must specify at least one upper or lower bound."
        },
        "ScalingAdjustment": {
          "Description": "The amount by which to scale. The adjustment is based on the value that you specified in the AdjustmentType property (either an absolute number or a percentage). A positive value adds to the current capacity and a negative number                                 subtracts from the current capacity.",
          "Array": false,
          "Type": "Number",
          "Required": "Yes"
        }
      }
    }
  }
}
