{
  "Resources": {
    "LoadBalancer": {
      "Name": "AWS::ElasticLoadBalancing::LoadBalancer",
      "Properties": {
        "AccessLoggingPolicy": {
          "Description": "Captures detailed information for all requests made to your load balancer, such                                 as the time a request was received, client’s IP address, latencies, request path,                                 and server responses.",
          "Array": false,
          "Type": "aws-properties-ec2-elb-accessloggingpolicy",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "AppCookieStickinessPolicy": {
          "Description": "Generates one or more stickiness policies with sticky session lifetimes that                                 follow that of an application-generated cookie. These policies can be associated                                 only with HTTP/HTTPS listeners.",
          "Array": true,
          "Type": "aws-properties-ec2-elb-AppCookieStickinessPolicy",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "AvailabilityZones": {
          "Description": "The Availability Zones in which to create the load balancer. You can specify                                 the AvailabilityZones or Subnets property, but not                                 both.NoteFor load balancers that are in a VPC, specify the Subnets                                    property.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement if you did not have an Availability Zone specified and you\n                                 are adding one or if you are removing all Availability Zones. Otherwise, update\n                                 requires no interruption."
        },
        "ConnectionDrainingPolicy": {
          "Description": "Whether deregistered or unhealthy instances can complete all in-flight                                 requests.",
          "Array": false,
          "Type": "aws-properties-ec2-elb-connectiondrainingpolicy",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "ConnectionSettings": {
          "Description": "Specifies how long front-end and back-end connections of your load balancer can                                 remain idle.",
          "Array": false,
          "Type": "aws-properties-ec2-elb-connectionsettings",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "CrossZone": {
          "Description": "Whether cross-zone load balancing is enabled for the load balancer. With                                 cross-zone load balancing, your load balancer nodes route traffic to the back-end                                 instances across all Availability Zones. By default the CrossZone                                 property is false.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "HealthCheck": {
          "Description": "Application health check for the instances.",
          "Array": false,
          "Type": "aws-properties-ec2-elb-health-check",
          "Required": "No",
          "UpdateRequires": "Replacement if you did not have a health check specified and you are\n                                 adding one or if you are removing a health check. Otherwise, update requires no interruption."
        },
        "Instances": {
          "Description": "A list of EC2 instance IDs for the load balancer.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "LBCookieStickinessPolicy": {
          "Description": "Generates a stickiness policy with sticky session lifetimes controlled by the                                 lifetime of the browser (user-agent), or by a specified expiration period. This                                 policy can be associated only with HTTP/HTTPS listeners.",
          "Array": true,
          "Type": "aws-properties-ec2-elb-LBCookieStickinessPolicy",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "LoadBalancerName": {
          "Description": "A name for the load balancer. For valid values, see the LoadBalancerName parameter for the CreateLoadBalancer action in the Elastic Load Balancing API Reference version 2012-06-01.If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the load balancer. The                                 name must be unique within your set of load balancers. For more information, see Name Type.                                                                     Important                                    If you specify a name, you cannot perform updates that require replacement of this resource.                                       You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.                                       You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "Listeners": {
          "Description": "One or more listeners for this load balancer. Each listener must be registered                                 for a specific port, and you cannot have more than one listener for a given                                 port.ImportantIf you update the property values for a listener specified by the                                    Listeners property, AWS CloudFormation will delete the existing listener and                                    create a new one with the updated properties. During the time that AWS CloudFormation is                                    performing this action, clients will not be able to connect to the load                                    balancer.",
          "Array": true,
          "Type": "aws-properties-ec2-elb-listener",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "Policies": {
          "Description": "A list of elastic load balancing policies to apply to this elastic load balancer. Specify only back-end server policies. For                                 more information, see DescribeLoadBalancerPolicyTypes in the Elastic Load Balancing API Reference version 2012-06-01.",
          "Array": true,
          "Type": "aws-properties-ec2-elb-policy",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Scheme": {
          "Description": "For load balancers attached to an Amazon VPC, this parameter can be used to                                 specify the type of load balancer to use. Specify internal to create                                 an internal load balancer with a DNS name that resolves to private IP addresses or                                 internet-facing to create a load balancer with a publicly                                 resolvable DNS name, which resolves to public IP addresses.Note                                    If you specify internal, you must specify subnets to                                       associate with the load balancer, not Availability Zones.NoteIf you specify internal, you must specify subnets to                                       associate with the load balancer, not Availability Zones.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "SecurityGroups": {
          "Description": "",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Subnets": {
          "Description": "A list of subnet IDs in your virtual private cloud (VPC) to attach to your load                                 balancer. Do not specify multiple subnets that are in the same Availability Zone.                                 You can specify the AvailabilityZones or Subnets                                 property, but not both.For more information about using Elastic Load Balancing in a VPC, see How Do I Use Elastic Load Balancing in Amazon VPC in the                                 Elastic Load Balancing Developer Guide.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement if you did not have an subnet specified and you are adding\n                                 one or if you are removing all subnets. Otherwise, update requires no interruption. To update the load\n                                 balancer to another subnet that is in the same Availability Zone, you must do two\n                                 updates. You must first update the load balancer to use a subnet in different\n                                 Availability Zone. After the update is complete, update the load balancer to use\n                                 the new subnet that is in the original Availability Zone."
        },
        "Tags": {
          "Description": "An arbitrary set of tags (key-value pairs) for this load balancer.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    }
  },
  "Models": {
    "aws-properties-ec2-elb-accessloggingpolicy": {
      "Name": "ElasticLoadBalancingAccessLoggingPolicy",
      "Properties": {
        "EmitInterval": {
          "Description": "The interval for publishing access logs in minutes. You can specify an interval                                 of either 5 minutes or 60 minutes.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "Enabled": {
          "Description": "Whether logging is enabled for the load balancer.",
          "Array": false,
          "Type": "Boolean",
          "Required": "Yes"
        },
        "S3BucketName": {
          "Description": "The name of an Amazon S3 bucket where access log files are stored.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "S3BucketPrefix": {
          "Description": "A prefix for the all log object keys, such as                                 my-load-balancer-logs/prod. If you store log files from multiple                                 sources in a single bucket, you can use a prefix to distinguish each log file and                                 its source.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        }
      }
    },
    "aws-properties-ec2-elb-AppCookieStickinessPolicy": {
      "Name": "ElasticLoadBalancingAppCookieStickinessPolicyType",
      "Properties": {
        "CookieName": {
          "Description": "Name of the application cookie used for stickiness.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "PolicyName": {
          "Description": "The name of the policy being created. The name must be unique within the set of                                 policies for this Load Balancer.                                                                     Note                                    To associate this policy with a listener, include the policy name in the                                       listener's PolicyNames property.NoteTo associate this policy with a listener, include the policy name in the                                       listener's PolicyNames property.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-ec2-elb-connectiondrainingpolicy": {
      "Name": "ElasticLoadBalancingConnectionDrainingPolicy",
      "Properties": {
        "Enabled": {
          "Description": "Whether or not connection draining is enabled for the load balancer.",
          "Array": false,
          "Type": "Boolean",
          "Required": "Yes"
        },
        "Timeout": {
          "Description": "The time in seconds after the load balancer closes all connections to a                                 deregistered or unhealthy instance.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        }
      }
    },
    "aws-properties-ec2-elb-connectionsettings": {
      "Name": "ElasticLoadBalancingConnectionSettings",
      "Properties": {
        "IdleTimeout": {
          "Description": "The time (in seconds) that a connection to the load balancer can remain idle,                                 which means no data is sent over the connection. After the specified time, the                                 load balancer closes the connection.",
          "Array": false,
          "Type": "Number",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-ec2-elb-health-check": {
      "Name": "ElasticLoadBalancingHealthCheckType",
      "Properties": {
        "HealthyThreshold": {
          "Description": "Specifies the number of consecutive health probe successes required before moving the instance to                                 the Healthy state.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Interval": {
          "Description": "Specifies the approximate interval, in seconds, between health checks of an individual                                 instance.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Target": {
          "Description": "Specifies the instance's protocol and port to check. The protocol can be TCP,                                 HTTP, HTTPS, or SSL. The range of valid ports is 1 through 65535.NoteFor TCP and SSL, you specify a port pair. For example, you can specify                                    TCP:5000 or SSL:5000. The health check attempts to                                    open a TCP or SSL connection to the instance on the port that you specify. If                                    the health check fails to connect within the configured timeout period, the                                    instance is considered unhealthy.For HTTP or HTTPS, you specify a port and a path to ping                                    (HTTP or                                             HTTPS:port/PathToPing).                                    For example, you can specify HTTP:80/weather/us/wa/seattle. In                                    this case, an HTTP GET request is issued to the instance on the given port and                                    path. If the health check receives any response other than 200 OK                                    within the configured timeout period, the instance is considered unhealthy. The                                    total length of the HTTP or HTTPS ping target cannot be more than 1024 16-bit                                    Unicode characters.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Timeout": {
          "Description": "Specifies the amount of time, in seconds, during which no response means a failed health probe.                                 This value must be less than the value for Interval.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "UnhealthyThreshold": {
          "Description": "Specifies the number of consecutive health probe failures required before moving the instance to                                 the Unhealthy state.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-ec2-elb-LBCookieStickinessPolicy": {
      "Name": "ElasticLoadBalancingLBCookieStickinessPolicyType",
      "Properties": {
        "CookieExpirationPeriod": {
          "Description": "The time period, in seconds, after which the cookie should be considered stale. If this parameter                                 isn't specified, the sticky session will last for the duration of the browser session.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "PolicyName": {
          "Description": "The name of the policy being created. The name must be unique within the set of                                 policies for this load balancer.NoteTo associate this policy with a listener, include the policy name in the                                    listener's PolicyNames                                    property.",
          "Array": false,
          "Type": "String"
        }
      }
    },
    "aws-properties-ec2-elb-listener": {
      "Name": "ElasticLoadBalancingListenerPropertyType",
      "Properties": {
        "InstancePort": {
          "Description": "Specifies the TCP port on which the instance server listens. You can't modify                                 this property during the life of the load balancer.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "InstanceProtocol": {
          "Description": "Specifies the protocol to use for routing traffic to back-end instances: HTTP,                                 HTTPS, TCP, or SSL. You can't modify this property during the life of the load                                 balancer.NoteIf the front-end protocol is HTTP or HTTPS,                                             InstanceProtocol must be on the same protocol layer (HTTP                                             or HTTPS). Likewise, if the front-end protocol is TCP or SSL,                                             InstanceProtocol must be TCP or SSL. By default, Elastic Load Balancing                                             sets the instance protocol to HTTP or TCP.If there is another Listener with the same                                             InstancePort whose InstanceProtocol is                                             secure, (using HTTPS or SSL), the InstanceProtocol of the                                             Listener must be secure (using HTTPS or SSL). If there is                                             another Listener with the same InstancePort                                             whose InstanceProtocol is HTTP or TCP, the                                             InstanceProtocol of the Listener must be                                             either HTTP or TCP.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "LoadBalancerPort": {
          "Description": "Specifies the external load balancer port number. You can't modify this                                 property during the life of the load balancer.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "PolicyNames": {
          "Description": "A list of ElasticLoadBalancing policy names to associate with the                                 Listener. Specify only policies that are compatible with a                                 Listener. For more information, see DescribeLoadBalancerPolicyTypes in the                                 Elastic Load Balancing API Reference version 2012-06-01.                                                                     Note                                    By default, Elastic Load Balancing associates the latest predefined policy with your load                                       balancer. When a new predefined policy is added, we recommend that you                                       update your load balancer to use the new predefined policy. Alternatively,                                       you can select a different predefined security policy or create a custom                                       policy. To create a security policy, use the Policies property                                       of the AWS::ElasticLoadBalancing::LoadBalancer resource.NoteBy default, Elastic Load Balancing associates the latest predefined policy with your load                                       balancer. When a new predefined policy is added, we recommend that you                                       update your load balancer to use the new predefined policy. Alternatively,                                       you can select a different predefined security policy or create a custom                                       policy. To create a security policy, use the Policies property                                       of the AWS::ElasticLoadBalancing::LoadBalancer resource.",
          "Array": true,
          "Type": "String",
          "Required": "No"
        },
        "Protocol": {
          "Description": "Specifies the load balancer transport protocol to use for routing: HTTP, HTTPS,                                 TCP or SSL. You can't modify this property during the life of the load                                 balancer.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "SSLCertificateId": {
          "Description": "The ARN of the SSL certificate to use. For more information about SSL                                 certificates, see Managing                                    Server Certificates in the AWS Identity and Access                                    Management User Guide.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        }
      }
    },
    "aws-properties-ec2-elb-policy": {
      "Name": "ElasticLoadBalancingPolicyType",
      "Properties": {
        "Attributes": {
          "Description": "A list of arbitrary attributes for this policy. If you don't need to specify                                 any policy attributes, specify an empty list ([]).",
          "Array": true,
          "Type": "Map",
          "Required": "Yes"
        },
        "InstancePorts": {
          "Description": "A list of instance ports for the policy. These are the ports associated with the back-end                                 server.",
          "Array": true,
          "Type": "String",
          "Required": "No"
        },
        "LoadBalancerPorts": {
          "Description": "A list of external load balancer ports for the policy.",
          "Array": true,
          "Type": "String",
          "Required": "Only for some policies. For more information,                                 see the Elastic Load Balancing                                       Developer Guide."
        },
        "PolicyName": {
          "Description": "A name for this policy that is unique to the load balancer.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "PolicyType": {
          "Description": "The name of the policy type for this policy. This must be one of the types reported by the Elastic Load Balancing                                 DescribeLoadBalancerPolicyTypes action.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-resource-tags": {
      "Name": "AWSCloudFormationResourceTagsType",
      "Properties": {
        "Key": {
          "Description": "The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with                                 aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Value": {
          "Description": "The value for the tag. You can specify a value that is 1 to 255 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    }
  }
}
