{
  "Resources": {
    "Domain": {
      "Name": "AWS::Elasticsearch::Domain",
      "Properties": {
        "AccessPolicies": {
          "Description": "An AWS Identity and Access Management (IAM) policy document that specifies who can access the Amazon ES                                 domain and their permissions. For more information, see Configuring Access Policies in the                                 Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "Object",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "AdvancedOptions": {
          "Description": "Additional options to specify for the Amazon ES domain. For more information, see                                 Configuring Advanced Options in the                                 Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "AJSONobjectconsistingofastringkey-valuepair,suchas:Copy{\"restaction.multi.allow_explicit_index\":\"true\"}",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "DomainName": {
          "Description": "A name for the Amazon ES domain. For valid values, see the DomainName data type in the Amazon Elasticsearch Service Developer Guide.If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the domain name. For more                                 information, see Name Type.                                                                     Important                                    If you specify a name, you cannot perform updates that require replacement of this resource.                                       You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.                                       You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "EBSOptions": {
          "Description": "The configurations of Amazon Elastic Block Store (Amazon EBS) volumes that are attached to data nodes in                                 the Amazon ES domain. For more information, see Configuring EBS-based Storage in the                                 Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "aws-properties-elasticsearch-domain-ebsoptions",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "ElasticsearchClusterConfig": {
          "Description": "The cluster configuration for the  Amazon ES domain. You can specify options such as                                 the instance type and the number of instances. For more information, see Configuring Amazon ES Domains in the                                 Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "aws-properties-elasticsearch-domain-elasticsearchclusterconfig",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "ElasticsearchVersion": {
          "Description": "The version of Elasticsearch to use, such as 2.3. For information about the versions that Amazon ES supports, see the Elasticsearch-Version parameter for the CreateElasticsearchDomain action in the Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "SnapshotOptions": {
          "Description": "The automated snapshot configuration for the Amazon ES domain indices.",
          "Array": false,
          "Type": "aws-properties-elasticsearch-domain-snapshotoptions",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Tags": {
          "Description": "An arbitrary set of tags (key–value pairs) to associate with the Amazon ES                                 domain.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    }
  },
  "Models": {
    "aws-properties-elasticsearch-domain-ebsoptions": {
      "Name": "AmazonElasticsearchServiceDomainEBSOptions",
      "Properties": {
        "EBSEnabled": {
          "Description": "Specifies whether Amazon EBS volumes are attached to data nodes in the Amazon ES                                 domain.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No"
        },
        "Iops": {
          "Description": "The number of I/O operations per second (IOPS) that the volume supports. This                                 property applies only to the Provisioned IOPS (SSD) EBS volume type.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "VolumeSize": {
          "Description": "The size of the EBS volume for each data node. The minimum and maximum size of an                                 EBS volume depends on the EBS volume type and the instance type to which it is attached.                                 For more information, see Configuring EBS-based Storage in the                                 Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "VolumeType": {
          "Description": "The EBS volume type to use with the Amazon ES domain, such as standard,                                 gp2, or io1. For more information about each type, see                                 Amazon EBS Volume Types in the Amazon EC2 User Guide for Linux Instances.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        }
      }
    },
    "aws-properties-elasticsearch-domain-elasticsearchclusterconfig": {
      "Name": "AmazonElasticsearchServiceDomainElasticsearchClusterConfig",
      "Properties": {
        "DedicatedMasterCount": {
          "Description": "The number of instances to use for the master node.If you specify this property, you must specify true for the                                 DedicatedMasterEnabled property",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "DedicatedMasterEnabled": {
          "Description": "Indicates whether to use a dedicated master node for the Amazon ES domain. A                                 dedicated master node is a cluster node that performs cluster management tasks, but                                 doesn't hold data or respond to data upload requests. Dedicated master nodes offload                                 cluster management tasks to increase the stability of your search clusters.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No"
        },
        "DedicatedMasterType": {
          "Description": "The hardware configuration of the computer that hosts the dedicated master node,                                 such as m3.medium.elasticsearch. For valid values, see Configuring Amazon ES Domains in the                                 Amazon Elasticsearch Service Developer Guide.If you specify this property, you must specify true for the                                 DedicatedMasterEnabled property",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "InstanceCount": {
          "Description": "The number of data nodes (instances) to use in the Amazon ES domain.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "InstanceType": {
          "Description": "The instance type for your data nodes, such as m3.medium.elasticsearch.                                 For valid values, see Configuring Amazon ES Domains in the                                 Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "ZoneAwarenessEnabled": {
          "Description": "Indicates whether to enable zone awareness for the Amazon ES domain. When you enable                                 zone awareness, Amazon ES allocates the nodes and replica index shards that belong to a                                 cluster across two Availability Zones (AZs) in the same region to prevent data loss and                                 minimize downtime in the event of node or data center failure. Don't enable zone                                 awareness if your cluster has no replica index shards or is a single-node cluster. For                                 more information, see Enabling Zone                                    Awareness in the Amazon Elasticsearch Service Developer Guide.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No"
        }
      }
    },
    "aws-properties-elasticsearch-domain-snapshotoptions": {
      "Name": "AmazonElasticsearchServiceDomainSnapshotOptions",
      "Properties": {
        "AutomatedSnapshotStartHour": {
          "Description": "The hour in UTC during which the service takes an automated daily snapshot of the                                 indices in the Amazon ES domain. For example, if you specify 0, Amazon ES                                 takes an automated snapshot everyday between midnight and 1 am. You can specify a value                                 between 0 and 23.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        }
      }
    },
    "aws-properties-resource-tags": {
      "Name": "AWSCloudFormationResourceTagsType",
      "Properties": {
        "Key": {
          "Description": "The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with                                 aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Value": {
          "Description": "The value for the tag. You can specify a value that is 1 to 255 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    }
  }
}
