{
  "Resources": {
    "DBInstance": {
      "Name": "AWS::RDS::DBInstance",
      "Properties": {
        "AllocatedStorage": {
          "Description": "The allocated storage size, specified in gigabytes (GB).If any value is set in the Iops parameter,                                 AllocatedStorage must be at least 100 GB, which                                 corresponds to the minimum Iops value of 1,000. If you                                 increase the Iops value (in 1,000 IOPS increments), then                                 you must also increase the AllocatedStorage value (in 100                                 GB increments).",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. This property is required unless you specify the                                 DBClusterIdentifier property. In that case, do not specify this                                 property.",
          "UpdateRequires": "No interruption"
        },
        "AllowMajorVersionUpgrade": {
          "Description": "If you update the EngineVersion property to a version that's                                 different from the DB instance's current major version, set this property to                                 true. For more information, see ModifyDBInstance in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "AutoMinorVersionUpgrade": {
          "Description": "Indicates that minor engine upgrades are applied automatically to the DB                                 instance during the maintenance window. The default value is                                 true.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "No interruption or some\n                                    interruptions. For more information, see ModifyDBInstance in the\n                                 Amazon Relational Database Service API Reference."
        },
        "AvailabilityZone": {
          "Description": "The name of the Availability Zone where the DB instance is located. You cannot                                 set the AvailabilityZone parameter if the                                 MultiAZ parameter is set to true.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "BackupRetentionPeriod": {
          "Description": "The number of days during which automatic DB snapshots are retained.ImportantIf this DB instance is deleted or replaced during an update, AWS CloudFormation deletes                                    all automated snapshots. However, it retains manual DB snapshots.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption or some\n                                    interruptions. For more information, see ModifyDBInstance in the\n                                 Amazon Relational Database Service API Reference."
        },
        "CharacterSetName": {
          "Description": "For supported engines, specifies the character set to associate with the DB                                 instance. For more information, see Appendix: Oracle                                    Character Sets Supported in Amazon RDS in the                                 Amazon Relational Database Service User Guide.If you specify the DBSnapshotIdentifier or                                 SourceDBInstanceIdentifier property, do not specify this property.                                 The value is inherited from the snapshot or source DB instance.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "CopyTagsToSnapshot": {
          "Description": "Indicates whether to copy all of the user-defined tags from the DB instance to                                 snapshots of the DB instance. By default, Amazon RDS doesn't copy tags to snapshots.                                 Amazon RDS doesn't copy tags with the aws:: prefix unless it's the DB                                 instance's final snapshot (the snapshot when you delete the DB instance).",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "DBClusterIdentifier": {
          "Description": "The name of an existing DB cluster that this instance will be associated with.                                 If you specify this property, specify aurora for the                                 Engine property and do not specify any of the following                                 properties: AllocatedStorage, BackupRetentionPeriod,                                 CharacterSetName, DBSecurityGroups,                                 PreferredBackupWindow, PreferredMaintenanceWindow,                                 Port, SourceDBInstanceIdentifier, or                                 StorageType.Amazon RDS assigns the first DB instance in the cluster as the primary, and                                 additional DB instances as replicas.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "DBInstanceClass": {
          "Description": "The name of the compute and memory capacity classes of the DB instance.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Some interruptions"
        },
        "DBInstanceIdentifier": {
          "Description": "A name for the DB instance. If you specify a name, AWS CloudFormation converts it to lower                                 case. If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses                                 that ID for the DB instance. For more information, see Name Type.ImportantIf you specify a name, you cannot perform updates that require replacement of this resource.                                    You can perform updates that require no or some interruption. If you must replace the resource, specify a new name.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "DBName": {
          "Description": "The name of the DB instance that was provided at the time of creation, if one                                 was specified. This same name is returned for the life of the DB instance.ImportantIf you specify the DBSnapshotIdentifier property, AWS CloudFormation ignores this property.If you restore DB instances from snapshots, this property doesn't apply to                                    the MySQL, PostgreSQL, or MariaDB engines.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "DBParameterGroupName": {
          "Description": "The name of an existing DB parameter group or a reference to an AWS::RDS::DBParameterGroup                                 resource created in the template.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption or some\n                                    interruptions. If any of the data members of the referenced parameter\n                                 group are changed during an update, the DB instance might need to be restarted,\n                                 causing some interruption. If the parameter group contains static parameters,\n                                 whether they were changed or not, an update triggers a reboot."
        },
        "DBSecurityGroups": {
          "Description": "A list of the DB security groups to assign to the DB instance. The list can                                 include both the name of existing DB security groups or references to AWS::RDS::DBSecurityGroup                                 resources created in the template.If you set DBSecurityGroups, you must not set VPCSecurityGroups, and                                 vice-versa.ImportantIf you specify this property, AWS CloudFormation sends only the following properties (if specified) to Amazon RDS:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   AllocatedStorage                                                                                                                                                                                                                           AutoMinorVersionUpgrade                                                                                                                                                                                                                           AvailabilityZone                                                                                                                                                                                                                           BackupRetentionPeriod                                                                                                                                                                                                                           CharacterSetName                                                                                                                                                                                                                           DbInstanceClass                                                                                                                                                                                                                           DbName                                                                                                                                                                                                                           DbParameterGroupName                                                                                                                                                                                                                           DbSecurityGroups                                                                                                                                                                                                                           DbSubnetGroupName                                                                                                                                                                                                                           Engine                                                                                                                                                                                                                           EngineVersion                                                                                                                                                                                                                           Iops                                                                                                                                                                                                                           LicenseModel                                                                                                                                                                                                                           MasterUsername                                                                                                                                                                                                                           MasterUserPassword                                                                                                                                                                                                                           MultiAZ                                                                                                                                                                                                                           OptionGroupName                                                                                                                                                                                                                           PreferredBackupWindow                                                                                                                                                                                                                           PreferredMaintenanceWindowAllocatedStorageAutoMinorVersionUpgradeAvailabilityZoneBackupRetentionPeriodCharacterSetNameDbInstanceClassDbNameDbParameterGroupNameDbSecurityGroupsDbSubnetGroupNameEngineEngineVersionIopsLicenseModelMasterUsernameMasterUserPasswordMultiAZOptionGroupNamePreferredBackupWindowPreferredMaintenanceWindowAll other properties are ignored. Specify a VPC security group if you want                                    to submit other properties, such as StorageType,                                    StorageEncrypted, or KmsKeyId. If you're already                                    using the DBSecurityGroups property, you can't use these other                                    properties by updating your DB instance to use a VPC security group. You must                                    recreate the DB instance.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "DBSnapshotIdentifier": {
          "Description": "The name or ARN of the DB snapshot used to restore the DB instance. If you are                                 restoring from a shared manual DB snapshot, you must specify the Amazon Resource                                 Name (ARN) of the snapshot.By specifying this property, you can create a DB instance from the specified DB                                 snapshot. If the DBSnapshotIdentifier property is an empty string or                                 the AWS::RDS::DBInstance declaration has no                                 DBSnapshotIdentifier property, AWS CloudFormation creates a new database. If                                 the property contains a value (other than an empty string), AWS CloudFormation creates a                                 database from the specified snapshot. If a snapshot with the specified name does                                 not exist, AWS CloudFormation can't create the database and it rolls the back the stack.Some DB instance properties are not valid when you restore from a snapshot,                                 such as the MasterUsername and MasterUserPassword                                 properties. For information about the properties that you can specify, see the                                 RestoreDBInstanceFromDBSnapshot action in the                                 Amazon Relational Database Service API Reference.ImportantIf you specify this property, AWS CloudFormation ignores the DBName property.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "DBSubnetGroupName": {
          "Description": "A DB subnet group to associate with the DB instance.If there is no DB subnet group, then the instance is not a VPC DB                                 instance.For more information about using Amazon RDS in a VPC, see Using Amazon RDS                                    with Amazon Virtual Private Cloud (VPC) in the                                 Amazon Relational Database Service Developer Guide.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "Domain": {
          "Description": "For an Amazon RDS DB instance that is running Microsoft SQL Server, the Active Directory                                 directory ID to create the instance in. Amazon RDS uses Windows Authentication to                                 authenticate users that connect to the DB instance. For more information, see                                 Using Windows                                    Authentication with an Amazon RDS DB Instance Running Microsoft SQL Server                                 in the Amazon Relational Database Service User Guide.If you specify this property, you must specify a SQL Server engine for the                                 Engine property.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "DomainIAMRoleName": {
          "Description": "The name of an IAM role that Amazon RDS uses when calling the Directory Service                                 APIs.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Engine": {
          "Description": "The database engine that the DB instance uses. This property is optional when                                 you specify the DBSnapshotIdentifier property to create DB                                 instances.For valid values, see the Engine parameter of the CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional",
          "UpdateRequires": "Replacement"
        },
        "EngineVersion": {
          "Description": "The version number of the database engine that the DB instance uses.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Some interruptions"
        },
        "Iops": {
          "Description": "The number of I/O operations per second (IOPS) that the database provisions.                                 The value must be equal to or greater than 1000.If you specify this property, you must follow the range of allowed ratios of                                 your requested IOPS rate to the amount of storage that you allocate (IOPS to                                 allocated storage).  For example, you can provision an Oracle database instance                                 with 1000 IOPS and 200 GB of storage (a ratio of 5:1) or                                 specify 2000 IOPS with 200 GB of storage (a ratio of 10:1). For more information,                                 see Amazon RDS Provisioned IOPS                                    Storage to Improve Performance in the                                 Amazon Relational Database Service User Guide.",
          "Array": false,
          "Type": "Number",
          "Required": "Conditional. If you specify io1 for the                                 StorageType property, you must specify this property.",
          "UpdateRequires": "No interruption"
        },
        "KmsKeyId": {
          "Description": "The ARN of the AWS Key Management Service (AWS KMS) master key that is used to encrypt the DB                                 instance, such as                                 arn:aws:kms:us-east-1:012345678910:key/abcd1234-a123-456a-a12b-a123b4cd56ef.                                 If you enable the StorageEncrypted property but don't specify this                                 property, AWS CloudFormation uses the default master key. If you specify this property, you                                 must set the StorageEncrypted property to true.If you specify the DBSnapshotIdentifier or                                 SourceDBInstanceIdentifier property, do not specify this property.                                 The value is inherited from the snapshot or source database instance.NoteIf you specify DBSecurityGroups, AWS CloudFormation ignores this property.                                    To specify both a security group and this property, you must use a VPC security                                    group. For more information about Amazon RDS and VPC, see Using Amazon RDS with Amazon VPC in the                                    Amazon Relational Database Service User Guide.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "LicenseModel": {
          "Description": "The license model of the DB instance.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "MasterUsername": {
          "Description": "The master user name for the DB instance.NoteIf you specify the SourceDBInstanceIdentifier or                                    DBSnapshotIdentifier property, do not specify this property.                                    The value is inherited from the source DB instance or snapshot.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional",
          "UpdateRequires": "Replacement"
        },
        "MasterUserPassword": {
          "Description": "The master password for the DB instance.NoteIf you specify the SourceDBInstanceIdentifier or                                    DBSnapshotIdentifier property, do not specify this property.                                    The value is inherited from the source DB instance or snapshot.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional",
          "UpdateRequires": "No interruption"
        },
        "MonitoringInterval": {
          "Description": "The interval, in seconds, between points when Amazon RDS collects enhanced                                 monitoring metrics for the DB instance. To disable metrics collection, specify                                 0.For default and valid values, see the MonitoringInterval parameter                                 for the CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "Number",
          "Required": "Conditional. If you specify the MonitoringRoleArn                                 property, specify a value other than 0 for                                 MonitoringInterval.",
          "UpdateRequires": "No interruption or some\n                                    interruptions. For more information, see ModifyDBInstance in the\n                                 Amazon Relational Database Service API Reference."
        },
        "MonitoringRoleArn": {
          "Description": "The ARN of the AWS Identity and Access Management (IAM) role that permits Amazon RDS to send enhanced                                 monitoring metrics to Amazon CloudWatch, for example,                                 arn:aws:iam:123456789012:role/emaccess. For information on creating a                                 monitoring role, see To create an IAM                                    role for Amazon RDS Enhanced Monitoring in the                                 Amazon Relational Database Service User Guide.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. If you specify a value other than 0 for                                 the MonitoringInterval property, specify a value for                                 MonitoringRoleArn.",
          "UpdateRequires": "No interruption"
        },
        "MultiAZ": {
          "Description": "Specifies if the database instance is a multiple Availability Zone deployment. You cannot set the AvailabilityZone parameter if the MultiAZ parameter is set to true.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "OptionGroupName": {
          "Description": "The option group that this DB instance is associated with.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Port": {
          "Description": "The port for the instance.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "PreferredBackupWindow": {
          "Description": "The daily time range during which automated backups are performed if automated                                 backups are enabled, as determined by the BackupRetentionPeriod                                 property. For valid values, see the PreferredBackupWindow parameter                                 for the CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "PreferredMaintenanceWindow": {
          "Description": "The weekly time range (in UTC) during which system maintenance can occur. For valid values, see the PreferredMaintenanceWindow parameter for the CreateDBInstance action in the Amazon Relational Database Service API Reference.                                                                     Note                                    This property applies when AWS CloudFormation initially creates the DB instance. If                                       you use AWS CloudFormation to update the DB instance, those updates are applied                                       immediately.NoteThis property applies when AWS CloudFormation initially creates the DB instance. If                                       you use AWS CloudFormation to update the DB instance, those updates are applied                                       immediately.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption or some\n                                    interruptions. For more information, see ModifyDBInstance in the\n                                 Amazon Relational Database Service API Reference."
        },
        "PubliclyAccessible": {
          "Description": "Indicates whether the DB instance is an Internet-facing instance. If you                                 specify true, AWS CloudFormation creates an instance with a publicly resolvable                                 DNS name, which resolves to a public IP address. If you specify                                 false, AWS CloudFormation creates an internal instance with a DNS name that                                 resolves to a private IP address.The default behavior value depends on your VPC setup and the database subnet                                 group. For more information, see the PubliclyAccessible parameter in                                 CreateDBInstance in the Amazon Relational Database Service API Reference.If this resource has a public IP address and is also in a VPC that is defined in the same template, you must use the                                 DependsOn attribute to declare a dependency on the VPC-gateway attachment. For more information,                                 see DependsOn Attribute.NoteIf you specify DBSecurityGroups, AWS CloudFormation ignores this property.                                    To specify a security group and this property, you must use a VPC security                                    group. For more information about Amazon RDS and VPC, see Using Amazon RDS with Amazon VPC in the                                    Amazon Relational Database Service User Guide.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "SourceDBInstanceIdentifier": {
          "Description": "If you want to create a read replica DB instance, specify the ID of the source                                 DB instance. Each DB instance can have a limited number of read replicas. For more                                 information, see Working with Read                                    Replicas in the Amazon Relational Database Service Developer Guide.The SourceDBInstanceIdentifier property determines whether a DB                                 instance is a read replica. If you remove the                                 SourceDBInstanceIdentifier property from your template and then                                 update your stack, AWS CloudFormation deletes the read replica and creates a new DB instance                                 (not a read replica).ImportantIf you specify a source DB instance that uses VPC security groups, we                                             recommend that you specify the VPCSecurityGroups property.                                             If you don't specify the property, the read replica inherits the value of                                             the VPCSecurityGroups property from the source DB when you                                             create the replica. However, if you update the stack, AWS CloudFormation reverts the                                             replica's VPCSecurityGroups property to the default value                                             because it's not defined in the stack's template. This change might cause                                             unexpected issues.Read replicas do not support deletion policies. AWS CloudFormation ignores any                                             deletion policy that's associated with a read replica.If you specify SourceDBInstanceIdentifier, do not set the                                             MultiAZ property to true and do not specify                                             the DBSnapshotIdentifier property. You cannot deploy read                                             replicas in multiple Availability Zones, and you cannot create a read                                             replica from a snapshot.Do not set the BackupRetentionPeriod,                                             DBName, MasterUsername,                                             MasterUserPassword, and                                             PreferredBackupWindow properties. The database attributes                                             are inherited from the source DB instance, and backups are disabled for                                             read replicas.If the source DB instance is in a different region than the read                                             replica, specify an ARN for a valid DB instance. For more information,                                             see Constructing a Amazon RDS Amazon Resource Name (ARN) in the                                             Amazon Relational Database Service User Guide.For DB instances in Amazon Aurora clusters, do not specify this                                             property. Amazon RDS automatically assigns writer and reader DB                                             instances.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "StorageEncrypted": {
          "Description": "Indicates whether the DB instance is encrypted.If you specify the DBClusterIdentifier,                                 DBSnapshotIdentifier, or SourceDBInstanceIdentifier                                 property, do not specify this property. The value is inherited from the cluster,                                 snapshot, or source DB instance.",
          "Array": false,
          "Type": "Boolean",
          "Required": "Conditional. If you specify the KmsKeyId property, you                                 must enable encryption.",
          "UpdateRequires": "Replacement"
        },
        "StorageType": {
          "Description": "The storage type associated with this DB instance.For the default and valid values, see the StorageType parameter of                                 the CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Some interruptions"
        },
        "Tags": {
          "Description": "An arbitrary set of tags (key–value pairs) for this DB instance.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "Timezone": {
          "Description": "The time zone of the DB instance, which you can specify to match the time zone                                 of your applications. To see which engines supports time zones, see the                                 Timezone parameter for the CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "VPCSecurityGroups": {
          "Description": "A list of the VPC security group IDs to assign to the DB instance. The list can                                 include both the physical IDs of existing VPC security groups and references to                                 AWS::EC2::SecurityGroup resources created in the                                 template.If you set VPCSecurityGroups, you must not set DBSecurityGroups, and vice                                 versa.ImportantYou                                    can migrate a                                    DB                                    instance in your stack from an RDS DB security group to a VPC security group, but                                    keep                                    the                                    following in mind:You cannot revert to using an RDS security group after you                                             establish a VPC security group membership.When you migrate your DB instance to VPC security groups, if your                                             stack update rolls back because the DB instance update fails, or because                                             an update fails in another AWS CloudFormation resource, the rollback will fail because                                             it cannot revert to an RDS security group.To use the properties that are available when you use a VPC security                                             group, you must recreate the DB instance. If you don't, AWS CloudFormation submits                                             only the property values that are listed in the DBSecurityGroups                                             property.To avoid this situation, migrate your DB instance to using VPC security                                    groups only when that is the only change in your stack template.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "DBParameterGroup": {
      "Name": "AWS::RDS::DBParameterGroup",
      "Properties": {
        "Description": {
          "Description": "A friendly description of the RDS parameter group. For example, \"My Parameter Group\".",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Updates are not supported."
        },
        "Family": {
          "Description": "The database family of this RDS parameter group. For example, \"MySQL5.1\".",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Updates are not supported."
        },
        "Parameters": {
          "Description": "The parameters to set for this RDS parameter group.",
          "Array": false,
          "Type": "Map",
          "Required": "No",
          "UpdateRequires": "No interruption or Some interruptions. Changes to dynamic parameters are applied immediately. During an update, if you have static parameters (whether they were\n                                 changed or not), triggers AWS CloudFormation to reboot the associated DB instance without failover."
        },
        "Tags": {
          "Description": "The tags that you want to attach to the RDS parameter group.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "DBSecurityGroup": {
      "Name": "AWS::RDS::DBSecurityGroup",
      "Properties": {
        "EC2VpcId": {
          "Description": "The Id of VPC. Indicates which VPC this DB Security Group should belong to.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. Must be specified to create a DB Security Group for                                 a VPC; may not be specified otherwise.",
          "UpdateRequires": "Replacement"
        },
        "DBSecurityGroupIngress": {
          "Description": "Network ingress authorization for an Amazon EC2 security group or an IP address range.",
          "Array": true,
          "Type": "aws-properties-rds-security-group-rule",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "GroupDescription": {
          "Description": "Description of the security group.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "Tags": {
          "Description": "The tags that you want to attach to the Amazon RDS DB security group.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "DBCluster": {
      "Name": "AWS::RDS::DBCluster",
      "Properties": {
        "AvailabilityZones": {
          "Description": "A list of Availability Zones (AZs) in which DB instances in the cluster can be                                 created.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "BackupRetentionPeriod": {
          "Description": "The number of days for which automatic backups are retained. For more                                 information, see CreateDBCluster in the Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "Number",
          "Required": "No",
          "UpdateRequires": "No interruption or some\n                                    interruptions. For more information, see ModifyDBInstance in the\n                                 Amazon Relational Database Service API Reference."
        },
        "DatabaseName": {
          "Description": "The name of your database. You can specify a name of up to eight alpha-numeric                                 characters. If you do not provide a name, Amazon Relational Database Service (Amazon RDS) won't create a                                 database in this DB cluster.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "DBClusterParameterGroupName": {
          "Description": "The name of the DB cluster parameter group to associate with this DB cluster.                                 For the default value, see the DBClusterParameterGroupName parameter                                 of the CreateDBCluster                                 action in the Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Some interruptions"
        },
        "DBSubnetGroupName": {
          "Description": "A DB subnet group that you want to associate with this DB cluster.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "Engine": {
          "Description": "The name of the database engine that you want to use for this DB                                 cluster.For valid values, see the Engine parameter of the CreateDBCluster action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "EngineVersion": {
          "Description": "The version number of the database engine that you want to use.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "KmsKeyId": {
          "Description": "The Amazon Resource Name (ARN) of the AWS Key Management Service master key that is used to                                 encrypt the database instances in the DB cluster, such as                                 arn:aws:kms:us-east-1:012345678910:key/abcd1234-a123-456a-a12b-a123b4cd56ef.                                 If you enable the StorageEncrypted property but don't specify this                                 property, the default master key is used. If you specify this property, you must                                 set the StorageEncrypted property to true.If you specify the SnapshotIdentifier, do not specify this                                 property. The value is inherited from the snapshot DB cluster.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement."
        },
        "MasterUsername": {
          "Description": "The master user name for the DB instance.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. You must specify this property unless you specify the                                 SnapshotIdentifier property. In that case, do not specify this                                 property.",
          "UpdateRequires": "Replacement."
        },
        "MasterUserPassword": {
          "Description": "The password for the master database user.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. You must specify this property unless you specify the                                 SnapshotIdentifier property. In that case, do not specify this                                 property.",
          "UpdateRequires": "No interruption"
        },
        "Port": {
          "Description": "The port number on which the DB instances in the cluster can accept                                 connections.",
          "Array": false,
          "Type": "Number",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "PreferredBackupWindow": {
          "Description": "if automated backups are enabled (see the BackupRetentionPeriod                                 property), the daily time range in UTC during which you want to create automated                                 backups.For valid values, see the PreferredBackupWindow parameter of the                                 CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "PreferredMaintenanceWindow": {
          "Description": "The weekly time range (in UTC) during which system maintenance can                                 occur.For valid values, see the PreferredMaintenanceWindow parameter of                                 the CreateDBInstance action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption or some\n                                    interruptions. For more information, see ModifyDBInstance in the\n                                 Amazon Relational Database Service API Reference."
        },
        "SnapshotIdentifier": {
          "Description": "The identifier for the DB cluster snapshot from which you want to                                 restore.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "StorageEncrypted": {
          "Description": "Indicates whether the DB instances in the cluster are encrypted.If you specify the SnapshotIdentifier property, do not specify                                 this property. The value is inherited from the snapshot DB cluster.",
          "Array": false,
          "Type": "Boolean",
          "Required": "Conditional. If you specify the KmsKeyId property, you                                 must enable encryption.",
          "UpdateRequires": "Replacement."
        },
        "Tags": {
          "Description": "The tags that you want to attach to this DB cluster.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "VpcSecurityGroupIds": {
          "Description": "A list of VPC security groups to associate with this DB cluster.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "DBClusterParameterGroup": {
      "Name": "AWS::RDS::DBClusterParameterGroup",
      "Properties": {
        "Description": {
          "Description": "A friendly description for this DB cluster parameter group.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "Family": {
          "Description": "The database family of this DB cluster parameter group, such as                                 aurora5.6.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "Parameters": {
          "Description": "The parameters to set for this DB cluster parameter group. For a list of                                 parameter keys, see Appendix: DB Cluster                                    and DB Instance Parameters in the                                 Amazon Relational Database Service User Guide.Changes to dynamic parameters are applied immediately. Changes to static                                 parameters require a reboot without failover to the DB instance that is associated                                 with the parameter group before the change can take effect.",
          "Array": false,
          "Type": "Map",
          "Required": "Yes",
          "UpdateRequires": "No interruption or some\n                                    interruptions, depending on the parameters that you update."
        },
        "Tags": {
          "Description": "The tags that you want to attach to this parameter group.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "Updates are not supported."
        }
      }
    },
    "DBSubnetGroup": {
      "Name": "AWS::RDS::DBSubnetGroup",
      "Properties": {
        "DBSubnetGroupDescription": {
          "Description": "The description for the DB Subnet Group.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "SubnetIds": {
          "Description": "The EC2 Subnet IDs for the DB Subnet Group.",
          "Array": true,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "Tags": {
          "Description": "The tags that you want to attach to the RDS database subnet group.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "OptionGroup": {
      "Name": "AWS::RDS::OptionGroup",
      "Properties": {
        "EngineName": {
          "Description": "The name of the database engine that this option group is associated                                 with.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "MajorEngineVersion": {
          "Description": "The major version number of the database engine that this option group is                                 associated with.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "OptionGroupDescription": {
          "Description": "A description of the option group.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "OptionConfigurations": {
          "Description": "The configurations for this option group.",
          "Array": false,
          "Type": "aws-properties-rds-optiongroup-optionconfigurations",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "Tags": {
          "Description": "An arbitrary set of tags (key–value pairs) for this option group.",
          "Array": true,
          "Type": "aws-properties-resource-tags",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "DBSecurityGroupIngress": {
      "Name": "AWS::RDS::DBSecurityGroupIngress",
      "Properties": {
        "DBSecurityGroupName": {
          "Description": "The name (ARN) of the AWS::RDS::DBSecurityGroup to which this ingress                                 will be added.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "No interruption"
        },
        "EC2SecurityGroupId": {
          "Description": "The ID of the VPC or EC2 security group to authorize.For VPC DB security groups, use EC2SecurityGroupId. For EC2 security groups, use                                 EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "EC2SecurityGroupName": {
          "Description": "The name of the EC2 security group to authorize.For VPC DB security groups, use EC2SecurityGroupId. For EC2 security groups, use                                 EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "EC2SecurityGroupOwnerId": {
          "Description": "The AWS Account Number of the owner of the EC2 security group specified in the EC2SecurityGroupName                                 parameter. The AWS Access Key ID is not an acceptable value.For VPC DB security groups, use EC2SecurityGroupId. For EC2 security groups, use                                 EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        }
      }
    },
    "EventSubscription": {
      "Name": "AWS::RDS::EventSubscription",
      "Properties": {
        "Enabled": {
          "Description": "Indicates whether to activate the subscription. If you don't specify this                                 property, AWS CloudFormation activates the subscription.",
          "Array": false,
          "Type": "Boolean",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "EventCategories": {
          "Description": "A list of event categories that you want to subscribe to for a given source type. If you don't specify this property, you                                 are notified about all event categories. For more information, see  Using Amazon RDS Event Notification in the Amazon Relational Database Service User Guide.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "SnsTopicArn": {
          "Description": "The Amazon Resource Name (ARN) of an Amazon SNS topic that you want to send event                                 notifications to.",
          "Array": false,
          "Type": "String",
          "Required": "Yes",
          "UpdateRequires": "Replacement"
        },
        "SourceIds": {
          "Description": "A list of identifiers for which Amazon RDS provides notification events.If you don't specify a value, notifications are provided for all sources. If                                 you specify multiple values, they must be of the same type. For example, if you                                 specify a database instance ID, all other values must be database instance                                 IDs.",
          "Array": true,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "No interruption"
        },
        "SourceType": {
          "Description": "The type of source for which Amazon RDS provides notification events. For example, if you want to be notified of events generated                                 by a database instance, set this parameter to db-instance. If you don't specify a value, notifications are provided for all source types. For valid values, see the SourceType parameter for the CreateEventSubscription action in the                                 Amazon Relational Database Service API Reference.",
          "Array": false,
          "Type": "String",
          "Required": "Conditional. If you specify the SourceIds or EventCategories property, you must specify this property.",
          "UpdateRequires": "Replacement if you're removing this property after it was previously\n                                 specified. All other updates require no\n                                    interruption."
        }
      }
    }
  },
  "Models": {
    "aws-properties-resource-tags": {
      "Name": "AWSCloudFormationResourceTagsType",
      "Properties": {
        "Key": {
          "Description": "The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with                                 aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "Value": {
          "Description": "The value for the tag. You can specify a value that is 1 to 255 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        }
      }
    },
    "aws-properties-rds-security-group-rule": {
      "Name": "AmazonRDSSecurityGroupRule",
      "Properties": {
        "CIDRIP": {
          "Description": "The IP range to authorize.For an overview of CIDR ranges, go to the Wikipedia                                    Tutorial.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "EC2SecurityGroupId": {
          "Description": "Id of the VPC or EC2 Security Group to authorize.For VPC DB Security Groups, use EC2SecurityGroupId. For EC2 Security Groups, use                                 EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "EC2SecurityGroupName": {
          "Description": "Name of the EC2 Security Group to authorize.For VPC DB Security Groups, use EC2SecurityGroupId. For EC2 Security Groups, use                                 EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        },
        "EC2SecurityGroupOwnerId": {
          "Description": "AWS Account Number of the owner of the EC2 Security Group specified in the EC2SecurityGroupName                                 parameter. The AWS Access Key ID is not an acceptable value.For VPC DB Security Groups, use EC2SecurityGroupId. For EC2 Security Groups, use                                 EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.",
          "Array": false,
          "Type": "String",
          "Required": "No",
          "UpdateRequires": "Replacement"
        }
      }
    },
    "aws-properties-rds-optiongroup-optionconfigurations": {
      "Name": "AmazonRDSOptionGroupOptionConfigurations",
      "Properties": {
        "DBSecurityGroupMemberships": {
          "Description": "A list of database security group names for this option. If the option requires                                 access to a port, the security groups must allow access to that port. If you specify                                 this property, don't specify the VPCSecurityGroupMemberships                                 property.",
          "Array": true,
          "Type": "String",
          "Required": "No"
        },
        "OptionName": {
          "Description": "The name of the option. For more information about options, see Working with Option                                    Groups in the Amazon Relational Database Service User                                    Guide.",
          "Array": false,
          "Type": "String",
          "Required": "Yes"
        },
        "OptionSettings": {
          "Description": "The settings for this option.",
          "Array": false,
          "Type": "aws-properties-rds-optiongroup-optionconfigurations-optionsettings",
          "Required": "No"
        },
        "Port": {
          "Description": "The port number that this option uses.",
          "Array": false,
          "Type": "Number",
          "Required": "No"
        },
        "VpcSecurityGroupMemberships": {
          "Description": "A list of VPC security group IDs for this option. If the option requires access to a                                 port, the security groups must allow access to that port. If you specify this property,                                 don't specify the DBSecurityGroupMemberships property.",
          "Array": true,
          "Type": "String",
          "Required": "No"
        }
      }
    },
    "aws-properties-rds-optiongroup-optionconfigurations-optionsettings": {
      "Name": "AmazonRDSOptionGroupOptionConfigurationsOptionSettings",
      "Properties": {
        "Name": {
          "Description": "The name of the option setting that you want to specify.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        },
        "Value": {
          "Description": "The value of the option setting.",
          "Array": false,
          "Type": "String",
          "Required": "No"
        }
      }
    }
  }
}
