{"Resources":{"RecordSet":{"Name":"AWS::Route53::RecordSet","Properties":{"AliasTarget":{"Description":"Alias resource record sets only: Information about the                                 domain to which you are redirecting traffic.If you specify this property, do not specify the TTL property. The                                 alias uses a TTL value from the alias target record.For more information about alias resource record sets, see Creating Alias Resource Record Sets in the Amazon Route 53 Developer                                    Guide and POST ChangeResourceRecordSets in the Amazon Route 53 API reference.","Array":false,"Type":"aws-properties-route53-aliastarget","Required":"Conditional. Required if you are creating an alias resource record                                 set.","UpdateRequires":"No interruption"},"Comment":{"Description":"Any comments that you want to include about the hosted zone.ImportantIf the record set is part of a record set group, this property isn't valid.                                    Don't specify this property.","Array":false,"Type":"String","Required":"No","UpdateRequires":"No interruption"},"Failover":{"Description":"Designates the record set as a PRIMARY or SECONDARY                                 failover record set. When you have more than one resource performing the same                                 function, you can configure Amazon Route 53 to check the health of your resources                                 and use                                 only health resources to respond to DNS queries. You cannot create nonfailover                                 resource record sets that have the same Name and Type                                 property values as failover resource record sets. For more information, see the                                 Failover content in the Amazon Route 53 API Reference.If you specify this property, you must specify the SetIdentifier                                 property.","Array":false,"Type":"String","Required":"No","UpdateRequires":"No interruption"},"GeoLocation":{"Description":"Describes how Amazon Route 53 responds to DNS queries based on the geographic origin                                 of                                 the query.","Array":false,"Type":"aws-properties-route53-recordset-geolocation","Required":"No","UpdateRequires":"No interruption"},"HealthCheckId":{"Description":"The health check ID that you want to apply to this record set. Amazon Route 53 returns                                 this resource record set in response to a DNS query only while record set is                                 healthy.","Array":false,"Type":"String","Required":"No","UpdateRequires":"No interruption"},"HostedZoneId":{"Description":"The ID of the hosted zone.","Array":false,"Type":"String","Required":"Conditional. You must specify either the                                 HostedZoneName or HostedZoneId,                                 but you cannot specify both. If this record set is part of a record set group, do                                 not specify this property.","UpdateRequires":"Replacement"},"HostedZoneName":{"Description":"The name of the domain for the hosted zone where you want to add the record                                 set.When you create a stack using an AWS::Route53::RecordSet that                                 specifies HostedZoneName, AWS CloudFormation attempts to find a hosted                                 zone whose name matches the HostedZoneName. If AWS CloudFormation cannot                                 find a hosted zone with a matching domain name, or if there is more than one                                 hosted zone with the specified domain name, AWS CloudFormation will not create the                                 stack.If you have multiple hosted zones with the same domain name, you must                                 explicitly specify the hosted zone using                                 HostedZoneId.","Array":false,"Type":"String","Required":"Conditional. You must specify either the                                 HostedZoneName or HostedZoneId,                                 but you cannot specify both. If this record set is part of a record set group, do                                 not specify this property.","UpdateRequires":"Replacement"},"Name":{"Description":"The name of the domain. You must specify a fully qualified domain name that                                 ends with a period as the last label indication. If you omit the final period,                                 Amazon Route 53 adds it.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"ResourceRecords":{"Description":"List of resource records to add. Each record should be in the format                                 appropriate for the record type specified by the Type                                 property. For information about different record types and their record formats,                                 see Values for Basic Resource Record Sets and                                  Appendix: Domain Name Format in the Amazon Route 53 Developer                                    Guide.","Array":true,"Type":"String","Required":"Conditional. If you don't specify the AliasTarget                                 property, you must specify this property. If you are creating an alias resource                                 record set, do not specify this property.","UpdateRequires":"No interruption"},"SetIdentifier":{"Description":"A unique identifier that differentiates among multiple resource record sets                                 that have the same combination of DNS name and type.For more information, see the SetIdentifier content in the Amazon Route 53 Developer                                    Guide.","Array":false,"Type":"String","Required":"Conditional. Required if you are creating a weighted, latency,                                 failover, or geolocation resource record set.","UpdateRequires":"No interruption"},"TTL":{"Description":"The resource record cache time to live (TTL), in seconds. If you specify this                                 property, do not specify the AliasTarget property. For alias target                                 records, the alias uses a TTL value from the target.If you specify this property, you must specify the                                 ResourceRecords property.","Array":false,"Type":"String","Required":"Conditional. If you don't specify the AliasTarget                                 property, you must specify this property. If you are creating an alias resource                                 record set, do not specify this property.","UpdateRequires":"No interruption"},"Type":{"Description":"The type of records to add. For valid values, see the Type content in the Amazon Route 53 API Reference. In AWS CloudFormation,                                 you can't create records of type NS or SOA.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"No interruption"},"Weight":{"Description":"Weighted resource record sets only: Among resource record                                 sets that have the same combination of DNS name and type, a value that determines                                 what portion of traffic for the current resource record set is routed to the                                 associated location.For more information about weighted resource record sets, see Setting Up Weighted Resource Record Sets in the Amazon Route 53                                    Developer Guide.","Array":false,"Type":"Number","Required":"Conditional. Required if you are creating a weighted resource record                                 set.","UpdateRequires":"No interruption"}}},"RecordSetGroup":{"Name":"AWS::Route53::RecordSetGroup","Properties":{"Comment":{"Description":"Any comments you want to include about the hosted zone.","Array":false,"Type":"String","Required":"No","UpdateRequires":"No interruption"},"HostedZoneId":{"Description":"The ID of the hosted zone.","Array":false,"Type":"String","Required":"Conditional: You must specify either the                                 HostedZoneName or HostedZoneId, but you cannot                                 specify both.","UpdateRequires":"Replacement"},"HostedZoneName":{"Description":"The name of the domain for the hosted zone where you want to add the record set.When you create a stack using an AWS::Route53::RecordSet that specifies                                 HostedZoneName, AWS CloudFormation attempts to find a hosted zone whose name matches the                                 HostedZoneName. If AWS CloudFormation cannot find a hosted zone with a matching domain                                 name, or if there is more than one hosted zone with the specified domain name, AWS                                 CloudFormation will not create                                 the stack.If you have multiple hosted zones with the same domain name, you must explicitly specify                                 the                                 hosted zone using HostedZoneId.","Array":false,"Type":"String","Required":"Conditional. You must specify either the                                 HostedZoneName or HostedZoneId, but you cannot                                 specify both.","UpdateRequires":"Replacement"},"RecordSets":{"Description":"List of resource record sets to add.Type:: List of AWS::Route53::RecordSet objects, as shown in the                                 following example:","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"No interruption"}}},"HealthCheck":{"Name":"AWS::Route53::HealthCheck","Properties":{"HealthCheckConfig":{"Description":"An Amazon Route 53 health check.","Array":false,"Type":"aws-properties-route53-healthcheck-healthcheckconfig","Required":"Yes","UpdateRequires":"No interruption"},"HealthCheckTags":{"Description":"An arbitrary set of tags (key–value pairs) for this health check.","Array":true,"Type":"aws-properties-route53-healthcheck-healthchecktags","Required":"No","UpdateRequires":"No interruption"}}},"HostedZone":{"Name":"AWS::Route53::HostedZone","Properties":{"HostedZoneConfig":{"Description":"A complex type that contains an optional comment about your hosted zone.","Array":false,"Type":"aws-properties-route53-hostedzone-hostedzoneconfig","Required":"No","UpdateRequires":"No interruption"},"HostedZoneTags":{"Description":"An arbitrary set of tags (key–value pairs) for this hosted zone.","Array":true,"Type":"aws-properties-route53-hostedzone-hostedzonetags","Required":"No","UpdateRequires":"No interruption"},"Name":{"Description":"The name of the domain. For resource record types that include a domain name,                                 specify a fully qualified domain name.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"},"VPCs":{"Description":"One or more VPCs that you want to associate with this hosted zone. When you                                 specify this property, AWS CloudFormation creates a private hosted zone.If this property was specified previously and you're modifying values, updates                                 require no interruption. If this                                 property wasn't specified and you add values, updates require replacement. Also, if this property was                                 specified and you remove all values, updates require replacement.","Array":true,"Type":"aws-resource-route53-hostedzone-hostedzonevpcs","Required":"No"}}}},"Models":{"aws-properties-route53-aliastarget":{"Name":"Route53AliasTargetProperty","Properties":{"DNSName":{"Description":"The DNS name of the load balancer, the domain name of the CloudFront distribution,                                 the website endpoint of the Amazon S3 bucket, or another record set in the same hosted                                 zone that is the target of the alias.","Array":false,"Type":"String","Required":"Yes"},"EvaluateTargetHealth":{"Description":"Whether Amazon Route 53 checks the health of the resource record sets in the alias                                 target                                 when responding to DNS queries. For more information about using this property,                                 see EvaluateTargetHealth in the                                 Amazon Route 53 API Reference.","Array":false,"Type":"Boolean","Required":"No"},"HostedZoneId":{"Description":"The hosted zone ID. For load balancers, use the canonical hosted zone ID of the                                 load balancer. For Amazon S3, use the hosted zone ID for your bucket's website                                 endpoint. For CloudFront, use Z2FDTNDATAQYW2. For a list of hosted zone IDs                                 of other services, see the relevant service in the AWS Regions and Endpoints.","Array":false,"Type":"String","Required":"Yes"}}},"aws-properties-route53-recordset-geolocation":{"Name":"AmazonRoute53RecordSetGeoLocationProperty","Properties":{"ContinentCode":{"Description":"All DNS queries from the continent that you specified are routed to this                                 resource record set. If you specify this property, omit the                                 CountryCode and SubdivisionCode properties.For valid values, see the ContinentCode element in the                                 Amazon Route 53 API Reference.","Array":false,"Type":"String","Required":"Conditional. You must specify this or the CountryCode                                 property."},"CountryCode":{"Description":"All DNS queries from the country that you specified are routed to this resource                                 record set. If you specify this property, omit the ContinentCode                                 property.For valid values, see the CountryCode element in the                                 Amazon Route 53 API Reference.","Array":false,"Type":"String","Required":"Conditional. You must specify this or the ContinentCode                                 property."},"SubdivisionCode":{"Description":"If you specified US for the country code, you can specify a state                                 in the United States. All DNS queries from the state that you specified are routed                                 to this resource record set. If you specify this property, you must specify                                 US for the CountryCode and omit the                                 ContinentCode property.For valid values, see the SubdivisionCode element in the                                 Amazon Route 53 API Reference.","Array":false,"Type":"String","Required":"No"}}},"aws-properties-route53-healthcheck-healthcheckconfig":{"Name":"AmazonRoute53HealthCheckConfig","Properties":{"AlarmIdentifier":{"Description":"Identifies the CloudWatch alarm that you want Amazon Route 53 health checkers to use                                 to determine whether this health check is healthy.","Array":false,"Type":"aws-properties-route53-healthcheck-healthcheckconfig-alarmidentifier","Required":"No"},"ChildHealthChecks":{"Description":"(CALCULATED Health Checks Only) A complex type that contains one ChildHealthCheck element for each                                  health check that you want to associate with a CALCULATED health check.","Array":true,"Type":"String","Required":"No"},"EnableSNI":{"Description":"Specifies whether you want Amazon Route 53 to send the value of                                 FullyQualifiedDomainName to the endpoint in the                                 client_hello message during TLS negotiation. This allows the                                 endpoint to respond to HTTPS health check requests with the                                 applicable SSL/TLS certificate. For more information, see http://docs.aws.amazon.com/Route53/latest/APIReference/API_HealthCheckConfig.html.","Array":false,"Type":"Boolean","Required":"No"},"FailureThreshold":{"Description":"The number of consecutive health checks that an endpoint must pass or fail for                                 Amazon Route 53 to change the current status of the endpoint from unhealthy to healthy                                 or                                 healthy to unhealthy.  For more information, see How Amazon Route 53 Determines Whether an Endpoint Is Healthy in the                                 Amazon Route 53 Developer Guide.","Array":false,"Type":"Number","Required":"No"},"FullyQualifiedDomainName":{"Description":"If you specified the IPAddress property, the value that you want                                 Amazon Route 53 to pass in the host header in all health checks except for TCP health                                 checks. If you don't specify an IP address, the domain that Amazon Route 53 sends                                 a DNS                                 request to. Amazon Route 53 uses the IP address that the DNS returns to check the                                 health of                                 the endpoint.","Array":false,"Type":"String","Required":"Conditional"},"HealthThreshold":{"Description":"The number of child health checks that are associated with a CALCULATED health that                                  Amazon Route 53 must consider healthy for the CALCULATED health check to be considered healthy.","Array":false,"Type":"Number","Required":"No"},"InsufficientDataHealthStatus":{"Description":"When Amazon CloudWatch has insufficient data about the metric to determine the alarm                                 state, the status that you want                                  Amazon Route 53 to assign to the health check (Healthy, Unhealthy, or LastKnownStatus).","Array":false,"Type":"String","Required":"No"},"Inverted":{"Description":"Specifies whether you want Amazon Route 53 to invert the status of a health check,                                 for                                 example, to consider a health check unhealthy when it otherwise would be                                 considered healthy.","Array":false,"Type":"Boolean","Required":"No"},"IPAddress":{"Description":"The IPv4 IP address of the endpoint on which you want Amazon Route 53 to perform health                                 checks. If you don't specify an IP address, Amazon Route 53 sends a DNS request to                                 resolve                                 the domain name that you specify in the FullyQualifiedDomainName                                 property.","Array":false,"Type":"String","Required":"No"},"MeasureLatency":{"Description":"Specifies whether you want Amazon Route 53 to measure the latency between health checkers                                 in multiple AWS regions and your endpoint and display CloudWatch latency graphs on                                 the                                 Health Checks page in the Amazon Route 53 console.","Array":false,"Type":"Boolean","Required":"No","UpdateRequires":"Replacement"},"Port":{"Description":"The port on the endpoint on which you want Amazon Route 53 to perform health                                 checks.","Array":false,"Type":"Number","Required":"Conditional. Required when you specify TCP for the                                 Type property."},"RequestInterval":{"Description":"The number of seconds between the time that Amazon Route 53 gets a response from your                                 endpoint and the time that it sends the next health check request. Each Amazon Route 53                                 health checker makes requests at this interval. For valid values, see the RequestInterval element in                                 the Amazon Route 53 API Reference.","Array":false,"Type":"Number","Required":"No","UpdateRequires":"Replacement"},"ResourcePath":{"Description":"The path that you want Amazon Route 53 to request when performing health checks. The                                 path                                 can be any value for which your endpoint returns an HTTP status code of                                 2xx or                                 3xx when the endpoint is healthy,                                 such as /docs/route53-health-check.html.","Array":false,"Type":"String","Required":"No"},"SearchString":{"Description":"If the value of the Type property is HTTP_STR_MATCH                                 or HTTPS_STR_MATCH, the string that you want Amazon Route 53 to search for in                                 the response body from the specified resource. If the string appears in the                                 response body, Amazon Route 53 considers the resource healthy.","Array":false,"Type":"String","Required":"No"},"Type":{"Description":"The type of health check that you want to create. This indicates how Amazon Route 53                                 determines whether an endpoint is healthy. You can specify HTTP,                                 HTTPS, HTTP_STR_MATCH, HTTPS_STR_MATCH,                                 or TCP. For information about the different types, see the Type element                                 in the Amazon Route 53 API Reference.","Array":false,"Type":"String","Required":"Yes","UpdateRequires":"Replacement"}}},"aws-properties-route53-healthcheck-healthcheckconfig-alarmidentifier":{"Name":"AmazonRoute53AlarmIdentifier","Properties":{"Name":{"Description":"The name of the Amazon CloudWatch alarm that you want Amazon Route 53 health checkers                                 to use to determine whether this health check is healthy.","Array":false,"Type":"String","Required":"Yes"},"Region":{"Description":"A complex type that identifies the CloudWatch alarm that you want Amazon Route 53                                 health checkers to use to determine whether this health check is healthy. For example,                                 us-west-2.","Array":false,"Type":"String","Required":"Yes"}}},"aws-properties-route53-healthcheck-healthchecktags":{"Name":"AmazonRoute53HealthCheckTags","Properties":{"Key":{"Description":"The key name of the tag.","Array":false,"Type":"String","Required":"Yes"},"Value":{"Description":"The value for the tag.","Array":false,"Type":"String","Required":"Yes"}}},"aws-properties-route53-hostedzone-hostedzoneconfig":{"Name":"AmazonRoute53HostedZoneConfigProperty","Properties":{"Comment":{"Description":"Any comments that you want to include about the hosted zone.","Array":false,"Type":"String","Required":"No"}}},"aws-properties-route53-hostedzone-hostedzonetags":{"Name":"AmazonRoute53HostedZoneTags","Properties":{"Key":{"Description":"The key name of the tag.","Array":false,"Type":"String","Required":"Yes"},"Value":{"Description":"The value for the tag.","Array":false,"Type":"String","Required":"Yes"}}},"aws-resource-route53-hostedzone-hostedzonevpcs":{"Name":"AmazonRoute53HostedZoneVPCs","Properties":{"VPCId":{"Description":"The ID of the Amazon VPC that you want to associate with the hosted zone.","Array":false,"Type":"String","Required":"Yes"},"VPCRegion":{"Description":"The region in which the Amazon VPC was created as specified in the                                 VPCId property.","Array":false,"Type":"String","Required":"Yes"}}}}}
